VDowbensky/efr32_baremetal/baremetal_test/device/efr32fg1v_modem_1.h
/***************************************************************************//**
 * @file
 * @brief EFR32FG1V_CRC register and bit field definitions
 *******************************************************************************
 * # License
 * <b>Copyright 2020 Silicon Laboratories Inc. www.silabs.com</b>
 *******************************************************************************
 *
 * SPDX-License-Identifier: Zlib
 *
 * The licensor of this software is Silicon Laboratories Inc.
 *
 * This software is provided 'as-is', without any express or implied
 * warranty. In no event will the authors be held liable for any damages
 * arising from the use of this software.
 *
 * Permission is granted to anyone to use this software for any purpose,
 * including commercial applications, and to alter it and redistribute it
 * freely, subject to the following restrictions:
 *
 * 1. The origin of this software must not be misrepresented; you must not
 *    claim that you wrote the original software. If you use this software
 *    in a product, an acknowledgment in the product documentation would be
 *    appreciated but is not required.
 * 2. Altered source versions must be plainly marked as such, and must not be
 *    misrepresented as being the original software.
 * 3. This notice may not be removed or altered from any source distribution.
 *
 ******************************************************************************/

#if defined(__ICCARM__)
#pragma system_include       /* Treat file as system include file. */
#elif defined(__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050)
#pragma clang system_header  /* Treat file as system include file. */
#endif

/***************************************************************************//**
 * @addtogroup Parts
 * @{
 ******************************************************************************/
/***************************************************************************//**
 * @defgroup EFR32FG1V_MODEM
 * @{
 * @brief EFR32FG1V_MODEM Register Declaration
 ******************************************************************************/
/* =========================================================================================================================== */
/* ================                                           MODEM                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief Modem controller (MODEM)
  */

typedef struct {                                /*!< (@ 0x40086000) MODEM Structure                                            */
  __IM  uint32_t  STATUS;                       /*!< (@ 0x00000000) STATUS                                                     */
  __IM  uint32_t  TIMDETSTATUS;                 /*!< (@ 0x00000004) TIMDETSTATUS                                               */
  __IM  uint32_t  FREQOFFEST;                   /*!< (@ 0x00000008) FREQOFFEST                                                 */
  __IM  uint32_t  AFCADJRX;                     /*!< (@ 0x0000000C) AFCADJRX                                                   */
  __IM  uint32_t  AFCADJTX;                     /*!< (@ 0x00000010) AFCADJTX                                                   */
  __IOM uint32_t  MIXCTRL;                      /*!< (@ 0x00000014) MIXCTRL                                                    */
  __IOM uint32_t  CTRL0;                        /*!< (@ 0x00000018) CTRL0                                                      */
  __IOM uint32_t  CTRL1;                        /*!< (@ 0x0000001C) CTRL1                                                      */
  __IOM uint32_t  CTRL2;                        /*!< (@ 0x00000020) CTRL2                                                      */
  __IOM uint32_t  CTRL3;                        /*!< (@ 0x00000024) CTRL3                                                      */
  __IOM uint32_t  CTRL4;                        /*!< (@ 0x00000028) CTRL4                                                      */
  __IOM uint32_t  CTRL5;                        /*!< (@ 0x0000002C) CTRL5                                                      */
  __IOM uint32_t  TXBR;                         /*!< (@ 0x00000030) TXBR                                                       */
  __IOM uint32_t  RXBR;                         /*!< (@ 0x00000034) RXBR                                                       */
  __IOM uint32_t  CF;                           /*!< (@ 0x00000038) CF                                                         */
  __IOM uint32_t  PRE;                          /*!< (@ 0x0000003C) PRE                                                        */
  __IOM uint32_t  SYNC0;                        /*!< (@ 0x00000040) SYNC0                                                      */
  __IOM uint32_t  SYNC1;                        /*!< (@ 0x00000044) SYNC1                                                      */
  __IOM uint32_t  TIMING;                       /*!< (@ 0x00000048) TIMING                                                     */
  __IOM uint32_t  DSSS0;                        /*!< (@ 0x0000004C) DSSS0                                                      */
  __IOM uint32_t  MODINDEX;                     /*!< (@ 0x00000050) MODINDEX                                                   */
  __IOM uint32_t  AFC;                          /*!< (@ 0x00000054) AFC                                                        */
  __IOM uint32_t  AFCADJLIM;                    /*!< (@ 0x00000058) AFCADJLIM                                                  */
  __IOM uint32_t  SHAPING0;                     /*!< (@ 0x0000005C) SHAPING0                                                   */
  __IOM uint32_t  SHAPING1;                     /*!< (@ 0x00000060) SHAPING1                                                   */
  __IOM uint32_t  SHAPING2;                     /*!< (@ 0x00000064) SHAPING2                                                   */
  __IOM uint32_t  RAMPCTRL;                     /*!< (@ 0x00000068) RAMPCTRL                                                   */
  __IOM uint32_t  RAMPLEV;                      /*!< (@ 0x0000006C) RAMPLEV                                                    */
  __IOM uint32_t  ROUTEPEN;                     /*!< (@ 0x00000070) ROUTEPEN                                                   */
  __IOM uint32_t  ROUTELOC0;                    /*!< (@ 0x00000074) ROUTELOC0                                                  */
  __IOM uint32_t  ROUTELOC1;                    /*!< (@ 0x00000078) ROUTELOC1                                                  */
  __IM  uint32_t  RESERVED;
  __IM  uint32_t  IF;                           /*!< (@ 0x00000080) IF                                                         */
  __OM  uint32_t  IFS;                          /*!< (@ 0x00000084) IFS                                                        */
  __OM  uint32_t  IFC;                          /*!< (@ 0x00000088) IFC                                                        */
  __IOM uint32_t  IEN;                          /*!< (@ 0x0000008C) IEN                                                        */
  __OM  uint32_t  CMD;                          /*!< (@ 0x00000090) CMD                                                        */
  __IM  uint32_t  RESERVED1;
  __IOM uint32_t  DCCOMP;                       /*!< (@ 0x00000098) DCCOMP                                                     */
  __IOM uint32_t  DCCOMPFILTINIT;               /*!< (@ 0x0000009C) DCCOMPFILTINIT                                             */
  __IM  uint32_t  RESERVED2[24];
  __IM  uint32_t  DCESTI;                       /*!< (@ 0x00000100) DCESTI                                                     */
  __IM  uint32_t  RESERVED3[191];
  __IOM uint32_t  RAM0_RAMDATA;                 /*!< (@ 0x00000400) RAM0_RAMDATA                                               */
  __IOM uint32_t  RAM1_RAMDATA;                 /*!< (@ 0x00000404) RAM1_RAMDATA                                               */
  __IOM uint32_t  RAM2_RAMDATA;                 /*!< (@ 0x00000408) RAM2_RAMDATA                                               */
  __IOM uint32_t  RAM3_RAMDATA;                 /*!< (@ 0x0000040C) RAM3_RAMDATA                                               */
  __IOM uint32_t  RAM4_RAMDATA;                 /*!< (@ 0x00000410) RAM4_RAMDATA                                               */
  __IOM uint32_t  RAM5_RAMDATA;                 /*!< (@ 0x00000414) RAM5_RAMDATA                                               */
  __IOM uint32_t  RAM6_RAMDATA;                 /*!< (@ 0x00000418) RAM6_RAMDATA                                               */
  __IOM uint32_t  RAM7_RAMDATA;                 /*!< (@ 0x0000041C) RAM7_RAMDATA                                               */
  __IOM uint32_t  RAM8_RAMDATA;                 /*!< (@ 0x00000420) RAM8_RAMDATA                                               */
  __IOM uint32_t  RAM9_RAMDATA;                 /*!< (@ 0x00000424) RAM9_RAMDATA                                               */
  __IOM uint32_t  RAM10_RAMDATA;                /*!< (@ 0x00000428) RAM10_RAMDATA                                              */
  __IOM uint32_t  RAM11_RAMDATA;                /*!< (@ 0x0000042C) RAM11_RAMDATA                                              */
  __IOM uint32_t  RAM12_RAMDATA;                /*!< (@ 0x00000430) RAM12_RAMDATA                                              */
  __IOM uint32_t  RAM13_RAMDATA;                /*!< (@ 0x00000434) RAM13_RAMDATA                                              */
  __IOM uint32_t  RAM14_RAMDATA;                /*!< (@ 0x00000438) RAM14_RAMDATA                                              */
  __IOM uint32_t  RAM15_RAMDATA;                /*!< (@ 0x0000043C) RAM15_RAMDATA                                              */
  __IOM uint32_t  RAM16_RAMDATA;                /*!< (@ 0x00000440) RAM16_RAMDATA                                              */
  __IOM uint32_t  RAM17_RAMDATA;                /*!< (@ 0x00000444) RAM17_RAMDATA                                              */
  __IOM uint32_t  RAM18_RAMDATA;                /*!< (@ 0x00000448) RAM18_RAMDATA                                              */
  __IOM uint32_t  RAM19_RAMDATA;                /*!< (@ 0x0000044C) RAM19_RAMDATA                                              */
  __IOM uint32_t  RAM20_RAMDATA;                /*!< (@ 0x00000450) RAM20_RAMDATA                                              */
  __IOM uint32_t  RAM21_RAMDATA;                /*!< (@ 0x00000454) RAM21_RAMDATA                                              */
  __IOM uint32_t  RAM22_RAMDATA;                /*!< (@ 0x00000458) RAM22_RAMDATA                                              */
  __IOM uint32_t  RAM23_RAMDATA;                /*!< (@ 0x0000045C) RAM23_RAMDATA                                              */
  __IOM uint32_t  RAM24_RAMDATA;                /*!< (@ 0x00000460) RAM24_RAMDATA                                              */
  __IOM uint32_t  RAM25_RAMDATA;                /*!< (@ 0x00000464) RAM25_RAMDATA                                              */
  __IOM uint32_t  RAM26_RAMDATA;                /*!< (@ 0x00000468) RAM26_RAMDATA                                              */
  __IOM uint32_t  RAM27_RAMDATA;                /*!< (@ 0x0000046C) RAM27_RAMDATA                                              */
  __IOM uint32_t  RAM28_RAMDATA;                /*!< (@ 0x00000470) RAM28_RAMDATA                                              */
  __IOM uint32_t  RAM29_RAMDATA;                /*!< (@ 0x00000474) RAM29_RAMDATA                                              */
  __IOM uint32_t  RAM30_RAMDATA;                /*!< (@ 0x00000478) RAM30_RAMDATA                                              */
  __IOM uint32_t  RAM31_RAMDATA;                /*!< (@ 0x0000047C) RAM31_RAMDATA                                              */
  __IOM uint32_t  RAM32_RAMDATA;                /*!< (@ 0x00000480) RAM32_RAMDATA                                              */
  __IOM uint32_t  RAM33_RAMDATA;                /*!< (@ 0x00000484) RAM33_RAMDATA                                              */
  __IOM uint32_t  RAM34_RAMDATA;                /*!< (@ 0x00000488) RAM34_RAMDATA                                              */
  __IOM uint32_t  RAM35_RAMDATA;                /*!< (@ 0x0000048C) RAM35_RAMDATA                                              */
  __IOM uint32_t  RAM36_RAMDATA;                /*!< (@ 0x00000490) RAM36_RAMDATA                                              */
  __IOM uint32_t  RAM37_RAMDATA;                /*!< (@ 0x00000494) RAM37_RAMDATA                                              */
  __IOM uint32_t  RAM38_RAMDATA;                /*!< (@ 0x00000498) RAM38_RAMDATA                                              */
  __IOM uint32_t  RAM39_RAMDATA;                /*!< (@ 0x0000049C) RAM39_RAMDATA                                              */
  __IOM uint32_t  RAM40_RAMDATA;                /*!< (@ 0x000004A0) RAM40_RAMDATA                                              */
  __IOM uint32_t  RAM41_RAMDATA;                /*!< (@ 0x000004A4) RAM41_RAMDATA                                              */
  __IOM uint32_t  RAM42_RAMDATA;                /*!< (@ 0x000004A8) RAM42_RAMDATA                                              */
  __IOM uint32_t  RAM43_RAMDATA;                /*!< (@ 0x000004AC) RAM43_RAMDATA                                              */
  __IOM uint32_t  RAM44_RAMDATA;                /*!< (@ 0x000004B0) RAM44_RAMDATA                                              */
  __IOM uint32_t  RAM45_RAMDATA;                /*!< (@ 0x000004B4) RAM45_RAMDATA                                              */
  __IOM uint32_t  RAM46_RAMDATA;                /*!< (@ 0x000004B8) RAM46_RAMDATA                                              */
  __IOM uint32_t  RAM47_RAMDATA;                /*!< (@ 0x000004BC) RAM47_RAMDATA                                              */
  __IOM uint32_t  RAM48_RAMDATA;                /*!< (@ 0x000004C0) RAM48_RAMDATA                                              */
  __IOM uint32_t  RAM49_RAMDATA;                /*!< (@ 0x000004C4) RAM49_RAMDATA                                              */
  __IOM uint32_t  RAM50_RAMDATA;                /*!< (@ 0x000004C8) RAM50_RAMDATA                                              */
  __IOM uint32_t  RAM51_RAMDATA;                /*!< (@ 0x000004CC) RAM51_RAMDATA                                              */
  __IOM uint32_t  RAM52_RAMDATA;                /*!< (@ 0x000004D0) RAM52_RAMDATA                                              */
  __IOM uint32_t  RAM53_RAMDATA;                /*!< (@ 0x000004D4) RAM53_RAMDATA                                              */
  __IOM uint32_t  RAM54_RAMDATA;                /*!< (@ 0x000004D8) RAM54_RAMDATA                                              */
  __IOM uint32_t  RAM55_RAMDATA;                /*!< (@ 0x000004DC) RAM55_RAMDATA                                              */
  __IOM uint32_t  RAM56_RAMDATA;                /*!< (@ 0x000004E0) RAM56_RAMDATA                                              */
  __IOM uint32_t  RAM57_RAMDATA;                /*!< (@ 0x000004E4) RAM57_RAMDATA                                              */
  __IOM uint32_t  RAM58_RAMDATA;                /*!< (@ 0x000004E8) RAM58_RAMDATA                                              */
  __IOM uint32_t  RAM59_RAMDATA;                /*!< (@ 0x000004EC) RAM59_RAMDATA                                              */
  __IOM uint32_t  RAM60_RAMDATA;                /*!< (@ 0x000004F0) RAM60_RAMDATA                                              */
  __IOM uint32_t  RAM61_RAMDATA;                /*!< (@ 0x000004F4) RAM61_RAMDATA                                              */
  __IOM uint32_t  RAM62_RAMDATA;                /*!< (@ 0x000004F8) RAM62_RAMDATA                                              */
  __IOM uint32_t  RAM63_RAMDATA;                /*!< (@ 0x000004FC) RAM63_RAMDATA                                              */
  __IOM uint32_t  RAM64_RAMDATA;                /*!< (@ 0x00000500) RAM64_RAMDATA                                              */
  __IOM uint32_t  RAM65_RAMDATA;                /*!< (@ 0x00000504) RAM65_RAMDATA                                              */
  __IOM uint32_t  RAM66_RAMDATA;                /*!< (@ 0x00000508) RAM66_RAMDATA                                              */
  __IOM uint32_t  RAM67_RAMDATA;                /*!< (@ 0x0000050C) RAM67_RAMDATA                                              */
  __IOM uint32_t  RAM68_RAMDATA;                /*!< (@ 0x00000510) RAM68_RAMDATA                                              */
  __IOM uint32_t  RAM69_RAMDATA;                /*!< (@ 0x00000514) RAM69_RAMDATA                                              */
  __IOM uint32_t  RAM70_RAMDATA;                /*!< (@ 0x00000518) RAM70_RAMDATA                                              */
  __IOM uint32_t  RAM71_RAMDATA;                /*!< (@ 0x0000051C) RAM71_RAMDATA                                              */
  __IOM uint32_t  RAM72_RAMDATA;                /*!< (@ 0x00000520) RAM72_RAMDATA                                              */
  __IOM uint32_t  RAM73_RAMDATA;                /*!< (@ 0x00000524) RAM73_RAMDATA                                              */
  __IOM uint32_t  RAM74_RAMDATA;                /*!< (@ 0x00000528) RAM74_RAMDATA                                              */
  __IOM uint32_t  RAM75_RAMDATA;                /*!< (@ 0x0000052C) RAM75_RAMDATA                                              */
  __IOM uint32_t  RAM76_RAMDATA;                /*!< (@ 0x00000530) RAM76_RAMDATA                                              */
  __IOM uint32_t  RAM77_RAMDATA;                /*!< (@ 0x00000534) RAM77_RAMDATA                                              */
  __IOM uint32_t  RAM78_RAMDATA;                /*!< (@ 0x00000538) RAM78_RAMDATA                                              */
  __IOM uint32_t  RAM79_RAMDATA;                /*!< (@ 0x0000053C) RAM79_RAMDATA                                              */
  __IOM uint32_t  RAM80_RAMDATA;                /*!< (@ 0x00000540) RAM80_RAMDATA                                              */
  __IOM uint32_t  RAM81_RAMDATA;                /*!< (@ 0x00000544) RAM81_RAMDATA                                              */
  __IOM uint32_t  RAM82_RAMDATA;                /*!< (@ 0x00000548) RAM82_RAMDATA                                              */
  __IOM uint32_t  RAM83_RAMDATA;                /*!< (@ 0x0000054C) RAM83_RAMDATA                                              */
  __IOM uint32_t  RAM84_RAMDATA;                /*!< (@ 0x00000550) RAM84_RAMDATA                                              */
  __IOM uint32_t  RAM85_RAMDATA;                /*!< (@ 0x00000554) RAM85_RAMDATA                                              */
  __IOM uint32_t  RAM86_RAMDATA;                /*!< (@ 0x00000558) RAM86_RAMDATA                                              */
  __IOM uint32_t  RAM87_RAMDATA;                /*!< (@ 0x0000055C) RAM87_RAMDATA                                              */
  __IOM uint32_t  RAM88_RAMDATA;                /*!< (@ 0x00000560) RAM88_RAMDATA                                              */
  __IOM uint32_t  RAM89_RAMDATA;                /*!< (@ 0x00000564) RAM89_RAMDATA                                              */
  __IOM uint32_t  RAM90_RAMDATA;                /*!< (@ 0x00000568) RAM90_RAMDATA                                              */
  __IOM uint32_t  RAM91_RAMDATA;                /*!< (@ 0x0000056C) RAM91_RAMDATA                                              */
  __IOM uint32_t  RAM92_RAMDATA;                /*!< (@ 0x00000570) RAM92_RAMDATA                                              */
  __IOM uint32_t  RAM93_RAMDATA;                /*!< (@ 0x00000574) RAM93_RAMDATA                                              */
  __IOM uint32_t  RAM94_RAMDATA;                /*!< (@ 0x00000578) RAM94_RAMDATA                                              */
  __IOM uint32_t  RAM95_RAMDATA;                /*!< (@ 0x0000057C) RAM95_RAMDATA                                              */
  __IOM uint32_t  RAM96_RAMDATA;                /*!< (@ 0x00000580) RAM96_RAMDATA                                              */
  __IOM uint32_t  RAM97_RAMDATA;                /*!< (@ 0x00000584) RAM97_RAMDATA                                              */
  __IOM uint32_t  RAM98_RAMDATA;                /*!< (@ 0x00000588) RAM98_RAMDATA                                              */
  __IOM uint32_t  RAM99_RAMDATA;                /*!< (@ 0x0000058C) RAM99_RAMDATA                                              */
  __IOM uint32_t  RAM100_RAMDATA;               /*!< (@ 0x00000590) RAM100_RAMDATA                                             */
  __IOM uint32_t  RAM101_RAMDATA;               /*!< (@ 0x00000594) RAM101_RAMDATA                                             */
  __IOM uint32_t  RAM102_RAMDATA;               /*!< (@ 0x00000598) RAM102_RAMDATA                                             */
  __IOM uint32_t  RAM103_RAMDATA;               /*!< (@ 0x0000059C) RAM103_RAMDATA                                             */
  __IOM uint32_t  RAM104_RAMDATA;               /*!< (@ 0x000005A0) RAM104_RAMDATA                                             */
  __IOM uint32_t  RAM105_RAMDATA;               /*!< (@ 0x000005A4) RAM105_RAMDATA                                             */
  __IOM uint32_t  RAM106_RAMDATA;               /*!< (@ 0x000005A8) RAM106_RAMDATA                                             */
  __IOM uint32_t  RAM107_RAMDATA;               /*!< (@ 0x000005AC) RAM107_RAMDATA                                             */
  __IOM uint32_t  RAM108_RAMDATA;               /*!< (@ 0x000005B0) RAM108_RAMDATA                                             */
  __IOM uint32_t  RAM109_RAMDATA;               /*!< (@ 0x000005B4) RAM109_RAMDATA                                             */
  __IOM uint32_t  RAM110_RAMDATA;               /*!< (@ 0x000005B8) RAM110_RAMDATA                                             */
  __IOM uint32_t  RAM111_RAMDATA;               /*!< (@ 0x000005BC) RAM111_RAMDATA                                             */
  __IOM uint32_t  RAM112_RAMDATA;               /*!< (@ 0x000005C0) RAM112_RAMDATA                                             */
  __IOM uint32_t  RAM113_RAMDATA;               /*!< (@ 0x000005C4) RAM113_RAMDATA                                             */
  __IOM uint32_t  RAM114_RAMDATA;               /*!< (@ 0x000005C8) RAM114_RAMDATA                                             */
  __IOM uint32_t  RAM115_RAMDATA;               /*!< (@ 0x000005CC) RAM115_RAMDATA                                             */
  __IOM uint32_t  RAM116_RAMDATA;               /*!< (@ 0x000005D0) RAM116_RAMDATA                                             */
  __IOM uint32_t  RAM117_RAMDATA;               /*!< (@ 0x000005D4) RAM117_RAMDATA                                             */
  __IOM uint32_t  RAM118_RAMDATA;               /*!< (@ 0x000005D8) RAM118_RAMDATA                                             */
  __IOM uint32_t  RAM119_RAMDATA;               /*!< (@ 0x000005DC) RAM119_RAMDATA                                             */
  __IOM uint32_t  RAM120_RAMDATA;               /*!< (@ 0x000005E0) RAM120_RAMDATA                                             */
  __IOM uint32_t  RAM121_RAMDATA;               /*!< (@ 0x000005E4) RAM121_RAMDATA                                             */
  __IOM uint32_t  RAM122_RAMDATA;               /*!< (@ 0x000005E8) RAM122_RAMDATA                                             */
  __IOM uint32_t  RAM123_RAMDATA;               /*!< (@ 0x000005EC) RAM123_RAMDATA                                             */
