VDowbensky/efr32_baremetal/baremetal_test/device/efr32fg1v_modem_1.h
  __IOM uint32_t  RAM124_RAMDATA;               /*!< (@ 0x000005F0) RAM124_RAMDATA                                             */
  __IOM uint32_t  RAM125_RAMDATA;               /*!< (@ 0x000005F4) RAM125_RAMDATA                                             */
  __IOM uint32_t  RAM126_RAMDATA;               /*!< (@ 0x000005F8) RAM126_RAMDATA                                             */
  __IOM uint32_t  RAM127_RAMDATA;               /*!< (@ 0x000005FC) RAM127_RAMDATA                                             */
  __IOM uint32_t  RAM128_RAMDATA;               /*!< (@ 0x00000600) RAM128_RAMDATA                                             */
  __IOM uint32_t  RAM129_RAMDATA;               /*!< (@ 0x00000604) RAM129_RAMDATA                                             */
  __IOM uint32_t  RAM130_RAMDATA;               /*!< (@ 0x00000608) RAM130_RAMDATA                                             */
  __IOM uint32_t  RAM131_RAMDATA;               /*!< (@ 0x0000060C) RAM131_RAMDATA                                             */
  __IOM uint32_t  RAM132_RAMDATA;               /*!< (@ 0x00000610) RAM132_RAMDATA                                             */
  __IOM uint32_t  RAM133_RAMDATA;               /*!< (@ 0x00000614) RAM133_RAMDATA                                             */
  __IOM uint32_t  RAM134_RAMDATA;               /*!< (@ 0x00000618) RAM134_RAMDATA                                             */
  __IOM uint32_t  RAM135_RAMDATA;               /*!< (@ 0x0000061C) RAM135_RAMDATA                                             */
  __IOM uint32_t  RAM136_RAMDATA;               /*!< (@ 0x00000620) RAM136_RAMDATA                                             */
  __IOM uint32_t  RAM137_RAMDATA;               /*!< (@ 0x00000624) RAM137_RAMDATA                                             */
  __IOM uint32_t  RAM138_RAMDATA;               /*!< (@ 0x00000628) RAM138_RAMDATA                                             */
  __IOM uint32_t  RAM139_RAMDATA;               /*!< (@ 0x0000062C) RAM139_RAMDATA                                             */
  __IOM uint32_t  RAM140_RAMDATA;               /*!< (@ 0x00000630) RAM140_RAMDATA                                             */
  __IOM uint32_t  RAM141_RAMDATA;               /*!< (@ 0x00000634) RAM141_RAMDATA                                             */
  __IOM uint32_t  RAM142_RAMDATA;               /*!< (@ 0x00000638) RAM142_RAMDATA                                             */
  __IOM uint32_t  RAM143_RAMDATA;               /*!< (@ 0x0000063C) RAM143_RAMDATA                                             */
  __IOM uint32_t  RAM144_RAMDATA;               /*!< (@ 0x00000640) RAM144_RAMDATA                                             */
  __IOM uint32_t  RAM145_RAMDATA;               /*!< (@ 0x00000644) RAM145_RAMDATA                                             */
  __IOM uint32_t  RAM146_RAMDATA;               /*!< (@ 0x00000648) RAM146_RAMDATA                                             */
  __IOM uint32_t  RAM147_RAMDATA;               /*!< (@ 0x0000064C) RAM147_RAMDATA                                             */
  __IOM uint32_t  RAM148_RAMDATA;               /*!< (@ 0x00000650) RAM148_RAMDATA                                             */
  __IOM uint32_t  RAM149_RAMDATA;               /*!< (@ 0x00000654) RAM149_RAMDATA                                             */
  __IOM uint32_t  RAM150_RAMDATA;               /*!< (@ 0x00000658) RAM150_RAMDATA                                             */
  __IOM uint32_t  RAM151_RAMDATA;               /*!< (@ 0x0000065C) RAM151_RAMDATA                                             */
  __IOM uint32_t  RAM152_RAMDATA;               /*!< (@ 0x00000660) RAM152_RAMDATA                                             */
  __IOM uint32_t  RAM153_RAMDATA;               /*!< (@ 0x00000664) RAM153_RAMDATA                                             */
  __IOM uint32_t  RAM154_RAMDATA;               /*!< (@ 0x00000668) RAM154_RAMDATA                                             */
  __IOM uint32_t  RAM155_RAMDATA;               /*!< (@ 0x0000066C) RAM155_RAMDATA                                             */
  __IOM uint32_t  RAM156_RAMDATA;               /*!< (@ 0x00000670) RAM156_RAMDATA                                             */
  __IOM uint32_t  RAM157_RAMDATA;               /*!< (@ 0x00000674) RAM157_RAMDATA                                             */
  __IOM uint32_t  RAM158_RAMDATA;               /*!< (@ 0x00000678) RAM158_RAMDATA                                             */
  __IOM uint32_t  RAM159_RAMDATA;               /*!< (@ 0x0000067C) RAM159_RAMDATA                                             */
  __IOM uint32_t  RAM160_RAMDATA;               /*!< (@ 0x00000680) RAM160_RAMDATA                                             */
  __IOM uint32_t  RAM161_RAMDATA;               /*!< (@ 0x00000684) RAM161_RAMDATA                                             */
  __IOM uint32_t  RAM162_RAMDATA;               /*!< (@ 0x00000688) RAM162_RAMDATA                                             */
  __IOM uint32_t  RAM163_RAMDATA;               /*!< (@ 0x0000068C) RAM163_RAMDATA                                             */
  __IOM uint32_t  RAM164_RAMDATA;               /*!< (@ 0x00000690) RAM164_RAMDATA                                             */
  __IOM uint32_t  RAM165_RAMDATA;               /*!< (@ 0x00000694) RAM165_RAMDATA                                             */
  __IOM uint32_t  RAM166_RAMDATA;               /*!< (@ 0x00000698) RAM166_RAMDATA                                             */
  __IOM uint32_t  RAM167_RAMDATA;               /*!< (@ 0x0000069C) RAM167_RAMDATA                                             */
  __IOM uint32_t  RAM168_RAMDATA;               /*!< (@ 0x000006A0) RAM168_RAMDATA                                             */
  __IOM uint32_t  RAM169_RAMDATA;               /*!< (@ 0x000006A4) RAM169_RAMDATA                                             */
  __IOM uint32_t  RAM170_RAMDATA;               /*!< (@ 0x000006A8) RAM170_RAMDATA                                             */
  __IOM uint32_t  RAM171_RAMDATA;               /*!< (@ 0x000006AC) RAM171_RAMDATA                                             */
  __IOM uint32_t  RAM172_RAMDATA;               /*!< (@ 0x000006B0) RAM172_RAMDATA                                             */
  __IOM uint32_t  RAM173_RAMDATA;               /*!< (@ 0x000006B4) RAM173_RAMDATA                                             */
  __IOM uint32_t  RAM174_RAMDATA;               /*!< (@ 0x000006B8) RAM174_RAMDATA                                             */
  __IOM uint32_t  RAM175_RAMDATA;               /*!< (@ 0x000006BC) RAM175_RAMDATA                                             */
  __IOM uint32_t  RAM176_RAMDATA;               /*!< (@ 0x000006C0) RAM176_RAMDATA                                             */
  __IOM uint32_t  RAM177_RAMDATA;               /*!< (@ 0x000006C4) RAM177_RAMDATA                                             */
  __IOM uint32_t  RAM178_RAMDATA;               /*!< (@ 0x000006C8) RAM178_RAMDATA                                             */
  __IOM uint32_t  RAM179_RAMDATA;               /*!< (@ 0x000006CC) RAM179_RAMDATA                                             */
  __IOM uint32_t  RAM180_RAMDATA;               /*!< (@ 0x000006D0) RAM180_RAMDATA                                             */
  __IOM uint32_t  RAM181_RAMDATA;               /*!< (@ 0x000006D4) RAM181_RAMDATA                                             */
  __IOM uint32_t  RAM182_RAMDATA;               /*!< (@ 0x000006D8) RAM182_RAMDATA                                             */
  __IOM uint32_t  RAM183_RAMDATA;               /*!< (@ 0x000006DC) RAM183_RAMDATA                                             */
  __IOM uint32_t  RAM184_RAMDATA;               /*!< (@ 0x000006E0) RAM184_RAMDATA                                             */
  __IOM uint32_t  RAM185_RAMDATA;               /*!< (@ 0x000006E4) RAM185_RAMDATA                                             */
  __IOM uint32_t  RAM186_RAMDATA;               /*!< (@ 0x000006E8) RAM186_RAMDATA                                             */
  __IOM uint32_t  RAM187_RAMDATA;               /*!< (@ 0x000006EC) RAM187_RAMDATA                                             */
  __IOM uint32_t  RAM188_RAMDATA;               /*!< (@ 0x000006F0) RAM188_RAMDATA                                             */
  __IOM uint32_t  RAM189_RAMDATA;               /*!< (@ 0x000006F4) RAM189_RAMDATA                                             */
  __IOM uint32_t  RAM190_RAMDATA;               /*!< (@ 0x000006F8) RAM190_RAMDATA                                             */
  __IOM uint32_t  RAM191_RAMDATA;               /*!< (@ 0x000006FC) RAM191_RAMDATA                                             */
  __IOM uint32_t  RAM192_RAMDATA;               /*!< (@ 0x00000700) RAM192_RAMDATA                                             */
  __IOM uint32_t  RAM193_RAMDATA;               /*!< (@ 0x00000704) RAM193_RAMDATA                                             */
  __IOM uint32_t  RAM194_RAMDATA;               /*!< (@ 0x00000708) RAM194_RAMDATA                                             */
  __IOM uint32_t  RAM195_RAMDATA;               /*!< (@ 0x0000070C) RAM195_RAMDATA                                             */
  __IOM uint32_t  RAM196_RAMDATA;               /*!< (@ 0x00000710) RAM196_RAMDATA                                             */
  __IOM uint32_t  RAM197_RAMDATA;               /*!< (@ 0x00000714) RAM197_RAMDATA                                             */
  __IOM uint32_t  RAM198_RAMDATA;               /*!< (@ 0x00000718) RAM198_RAMDATA                                             */
  __IOM uint32_t  RAM199_RAMDATA;               /*!< (@ 0x0000071C) RAM199_RAMDATA                                             */
  __IOM uint32_t  RAM200_RAMDATA;               /*!< (@ 0x00000720) RAM200_RAMDATA                                             */
  __IOM uint32_t  RAM201_RAMDATA;               /*!< (@ 0x00000724) RAM201_RAMDATA                                             */
  __IOM uint32_t  RAM202_RAMDATA;               /*!< (@ 0x00000728) RAM202_RAMDATA                                             */
  __IOM uint32_t  RAM203_RAMDATA;               /*!< (@ 0x0000072C) RAM203_RAMDATA                                             */
  __IOM uint32_t  RAM204_RAMDATA;               /*!< (@ 0x00000730) RAM204_RAMDATA                                             */
  __IOM uint32_t  RAM205_RAMDATA;               /*!< (@ 0x00000734) RAM205_RAMDATA                                             */
  __IOM uint32_t  RAM206_RAMDATA;               /*!< (@ 0x00000738) RAM206_RAMDATA                                             */
  __IOM uint32_t  RAM207_RAMDATA;               /*!< (@ 0x0000073C) RAM207_RAMDATA                                             */
  __IOM uint32_t  RAM208_RAMDATA;               /*!< (@ 0x00000740) RAM208_RAMDATA                                             */
  __IOM uint32_t  RAM209_RAMDATA;               /*!< (@ 0x00000744) RAM209_RAMDATA                                             */
  __IOM uint32_t  RAM210_RAMDATA;               /*!< (@ 0x00000748) RAM210_RAMDATA                                             */
  __IOM uint32_t  RAM211_RAMDATA;               /*!< (@ 0x0000074C) RAM211_RAMDATA                                             */
  __IOM uint32_t  RAM212_RAMDATA;               /*!< (@ 0x00000750) RAM212_RAMDATA                                             */
  __IOM uint32_t  RAM213_RAMDATA;               /*!< (@ 0x00000754) RAM213_RAMDATA                                             */
  __IOM uint32_t  RAM214_RAMDATA;               /*!< (@ 0x00000758) RAM214_RAMDATA                                             */
  __IOM uint32_t  RAM215_RAMDATA;               /*!< (@ 0x0000075C) RAM215_RAMDATA                                             */
  __IOM uint32_t  RAM216_RAMDATA;               /*!< (@ 0x00000760) RAM216_RAMDATA                                             */
  __IOM uint32_t  RAM217_RAMDATA;               /*!< (@ 0x00000764) RAM217_RAMDATA                                             */
  __IOM uint32_t  RAM218_RAMDATA;               /*!< (@ 0x00000768) RAM218_RAMDATA                                             */
  __IOM uint32_t  RAM219_RAMDATA;               /*!< (@ 0x0000076C) RAM219_RAMDATA                                             */
  __IOM uint32_t  RAM220_RAMDATA;               /*!< (@ 0x00000770) RAM220_RAMDATA                                             */
  __IOM uint32_t  RAM221_RAMDATA;               /*!< (@ 0x00000774) RAM221_RAMDATA                                             */
  __IOM uint32_t  RAM222_RAMDATA;               /*!< (@ 0x00000778) RAM222_RAMDATA                                             */
  __IOM uint32_t  RAM223_RAMDATA;               /*!< (@ 0x0000077C) RAM223_RAMDATA                                             */
  __IOM uint32_t  RAM224_RAMDATA;               /*!< (@ 0x00000780) RAM224_RAMDATA                                             */
  __IOM uint32_t  RAM225_RAMDATA;               /*!< (@ 0x00000784) RAM225_RAMDATA                                             */
  __IOM uint32_t  RAM226_RAMDATA;               /*!< (@ 0x00000788) RAM226_RAMDATA                                             */
  __IOM uint32_t  RAM227_RAMDATA;               /*!< (@ 0x0000078C) RAM227_RAMDATA                                             */
  __IOM uint32_t  RAM228_RAMDATA;               /*!< (@ 0x00000790) RAM228_RAMDATA                                             */
  __IOM uint32_t  RAM229_RAMDATA;               /*!< (@ 0x00000794) RAM229_RAMDATA                                             */
  __IOM uint32_t  RAM230_RAMDATA;               /*!< (@ 0x00000798) RAM230_RAMDATA                                             */
  __IOM uint32_t  RAM231_RAMDATA;               /*!< (@ 0x0000079C) RAM231_RAMDATA                                             */
  __IOM uint32_t  RAM232_RAMDATA;               /*!< (@ 0x000007A0) RAM232_RAMDATA                                             */
  __IOM uint32_t  RAM233_RAMDATA;               /*!< (@ 0x000007A4) RAM233_RAMDATA                                             */
  __IOM uint32_t  RAM234_RAMDATA;               /*!< (@ 0x000007A8) RAM234_RAMDATA                                             */
  __IOM uint32_t  RAM235_RAMDATA;               /*!< (@ 0x000007AC) RAM235_RAMDATA                                             */
  __IOM uint32_t  RAM236_RAMDATA;               /*!< (@ 0x000007B0) RAM236_RAMDATA                                             */
  __IOM uint32_t  RAM237_RAMDATA;               /*!< (@ 0x000007B4) RAM237_RAMDATA                                             */
  __IOM uint32_t  RAM238_RAMDATA;               /*!< (@ 0x000007B8) RAM238_RAMDATA                                             */
  __IOM uint32_t  RAM239_RAMDATA;               /*!< (@ 0x000007BC) RAM239_RAMDATA                                             */
  __IOM uint32_t  RAM240_RAMDATA;               /*!< (@ 0x000007C0) RAM240_RAMDATA                                             */
  __IOM uint32_t  RAM241_RAMDATA;               /*!< (@ 0x000007C4) RAM241_RAMDATA                                             */
  __IOM uint32_t  RAM242_RAMDATA;               /*!< (@ 0x000007C8) RAM242_RAMDATA                                             */
  __IOM uint32_t  RAM243_RAMDATA;               /*!< (@ 0x000007CC) RAM243_RAMDATA                                             */
  __IOM uint32_t  RAM244_RAMDATA;               /*!< (@ 0x000007D0) RAM244_RAMDATA                                             */
  __IOM uint32_t  RAM245_RAMDATA;               /*!< (@ 0x000007D4) RAM245_RAMDATA                                             */
  __IOM uint32_t  RAM246_RAMDATA;               /*!< (@ 0x000007D8) RAM246_RAMDATA                                             */
  __IOM uint32_t  RAM247_RAMDATA;               /*!< (@ 0x000007DC) RAM247_RAMDATA                                             */
  __IOM uint32_t  RAM248_RAMDATA;               /*!< (@ 0x000007E0) RAM248_RAMDATA                                             */
  __IOM uint32_t  RAM249_RAMDATA;               /*!< (@ 0x000007E4) RAM249_RAMDATA                                             */
  __IOM uint32_t  RAM250_RAMDATA;               /*!< (@ 0x000007E8) RAM250_RAMDATA                                             */
  __IOM uint32_t  RAM251_RAMDATA;               /*!< (@ 0x000007EC) RAM251_RAMDATA                                             */
  __IOM uint32_t  RAM252_RAMDATA;               /*!< (@ 0x000007F0) RAM252_RAMDATA                                             */
  __IOM uint32_t  RAM253_RAMDATA;               /*!< (@ 0x000007F4) RAM253_RAMDATA                                             */
  __IOM uint32_t  RAM254_RAMDATA;               /*!< (@ 0x000007F8) RAM254_RAMDATA                                             */
  __IOM uint32_t  RAM255_RAMDATA;               /*!< (@ 0x000007FC) RAM255_RAMDATA                                             */
} MODEM_Typedef;                                   /*!< Size = 2048 (0x800)                                                       */


/***************************************************************************//**
 * @addtogroup EFR32FG1V_MODEM
 * @{
 * @defgroup EFR32FG1V_MODEM BitFields  MODEM Bit Fields
 * @{
 ******************************************************************************/
/* =========================================================================================================================== */
/* ================                                           MODEM                                           ================ */
/* =========================================================================================================================== */

