VDowbensky/efr32_baremetal/baremetal_test/device/efr32fg1v_modem_1.h
#define MODEM_TXBR_TXBRDEN_Msk            (0xff0000UL)              /*!< TXBRDEN (Bitfield-Mask: 0xff)                         */
/* =========================================================  RXBR  ========================================================== */
#define MODEM_RXBR_RXBRNUM_Pos            (0UL)                     /*!< RXBRNUM (Bit 0)                                       */
#define MODEM_RXBR_RXBRNUM_Msk            (0x1fUL)                  /*!< RXBRNUM (Bitfield-Mask: 0x1f)                         */
#define MODEM_RXBR_RXBRDEN_Pos            (5UL)                     /*!< RXBRDEN (Bit 5)                                       */
#define MODEM_RXBR_RXBRDEN_Msk            (0x3e0UL)                 /*!< RXBRDEN (Bitfield-Mask: 0x1f)                         */
#define MODEM_RXBR_RXBRINT_Pos            (10UL)                    /*!< RXBRINT (Bit 10)                                      */
#define MODEM_RXBR_RXBRINT_Msk            (0x1c00UL)                /*!< RXBRINT (Bitfield-Mask: 0x07)                         */
/* ==========================================================  CF  =========================================================== */
#define MODEM_CF_DEC0_Pos                 (0UL)                     /*!< DEC0 (Bit 0)                                          */
#define MODEM_CF_DEC0_Msk                 (0x7UL)                   /*!< DEC0 (Bitfield-Mask: 0x07)                            */
#define MODEM_CF_DEC1_Pos                 (3UL)                     /*!< DEC1 (Bit 3)                                          */
#define MODEM_CF_DEC1_Msk                 (0x1fff8UL)               /*!< DEC1 (Bitfield-Mask: 0x3fff)                          */
#define MODEM_CF_DEC2_Pos                 (17UL)                    /*!< DEC2 (Bit 17)                                         */
#define MODEM_CF_DEC2_Msk                 (0x7e0000UL)              /*!< DEC2 (Bitfield-Mask: 0x3f)                            */
#define MODEM_CF_CFOSR_Pos                (23UL)                    /*!< CFOSR (Bit 23)                                        */
#define MODEM_CF_CFOSR_Msk                (0x3800000UL)             /*!< CFOSR (Bitfield-Mask: 0x07)                           */
#define MODEM_CF_DEC1GAIN_Pos             (26UL)                    /*!< DEC1GAIN (Bit 26)                                     */
#define MODEM_CF_DEC1GAIN_Msk             (0xc000000UL)             /*!< DEC1GAIN (Bitfield-Mask: 0x03)                        */
#define MODEM_CF_RESYNCRESETTIMING_Pos    (28UL)                    /*!< RESYNCRESETTIMING (Bit 28)                            */
#define MODEM_CF_RESYNCRESETTIMING_Msk    (0x10000000UL)            /*!< RESYNCRESETTIMING (Bitfield-Mask: 0x01)               */
#define MODEM_CF_RESYNCBYPASS_Pos         (29UL)                    /*!< RESYNCBYPASS (Bit 29)                                 */
#define MODEM_CF_RESYNCBYPASS_Msk         (0x20000000UL)            /*!< RESYNCBYPASS (Bitfield-Mask: 0x01)                    */
/* ==========================================================  PRE  ========================================================== */
#define MODEM_PRE_BASE_Pos                (0UL)                     /*!< BASE (Bit 0)                                          */
#define MODEM_PRE_BASE_Msk                (0xfUL)                   /*!< BASE (Bitfield-Mask: 0x0f)                            */
#define MODEM_PRE_BASEBITS_Pos            (4UL)                     /*!< BASEBITS (Bit 4)                                      */
#define MODEM_PRE_BASEBITS_Msk            (0x30UL)                  /*!< BASEBITS (Bitfield-Mask: 0x03)                        */
#define MODEM_PRE_PRESYMB4FSK_Pos         (6UL)                     /*!< PRESYMB4FSK (Bit 6)                                   */
#define MODEM_PRE_PRESYMB4FSK_Msk         (0x40UL)                  /*!< PRESYMB4FSK (Bitfield-Mask: 0x01)                     */
#define MODEM_PRE_PREERRORS_Pos           (7UL)                     /*!< PREERRORS (Bit 7)                                     */
#define MODEM_PRE_PREERRORS_Msk           (0x780UL)                 /*!< PREERRORS (Bitfield-Mask: 0x0f)                       */
#define MODEM_PRE_DSSSPRE_Pos             (11UL)                    /*!< DSSSPRE (Bit 11)                                      */
#define MODEM_PRE_DSSSPRE_Msk             (0x800UL)                 /*!< DSSSPRE (Bitfield-Mask: 0x01)                         */
#define MODEM_PRE_SYNCSYMB4FSK_Pos        (12UL)                    /*!< SYNCSYMB4FSK (Bit 12)                                 */
#define MODEM_PRE_SYNCSYMB4FSK_Msk        (0x1000UL)                /*!< SYNCSYMB4FSK (Bitfield-Mask: 0x01)                    */
#define MODEM_PRE_TXBASES_Pos             (16UL)                    /*!< TXBASES (Bit 16)                                      */
#define MODEM_PRE_TXBASES_Msk             (0xffff0000UL)            /*!< TXBASES (Bitfield-Mask: 0xffff)                       */
/* =========================================================  SYNC0  ========================================================= */
#define MODEM_SYNC0_SYNC0_Pos             (0UL)                     /*!< SYNC0 (Bit 0)                                         */
#define MODEM_SYNC0_SYNC0_Msk             (0xffffffffUL)            /*!< SYNC0 (Bitfield-Mask: 0xffffffff)                     */
/* =========================================================  SYNC1  ========================================================= */
#define MODEM_SYNC1_SYNC1_Pos             (0UL)                     /*!< SYNC1 (Bit 0)                                         */
#define MODEM_SYNC1_SYNC1_Msk             (0xffffffffUL)            /*!< SYNC1 (Bitfield-Mask: 0xffffffff)                     */
/* ========================================================  TIMING  ========================================================= */
#define MODEM_TIMING_TIMTHRESH_Pos        (0UL)                     /*!< TIMTHRESH (Bit 0)                                     */
#define MODEM_TIMING_TIMTHRESH_Msk        (0xffUL)                  /*!< TIMTHRESH (Bitfield-Mask: 0xff)                       */
#define MODEM_TIMING_TIMINGBASES_Pos      (8UL)                     /*!< TIMINGBASES (Bit 8)                                   */
#define MODEM_TIMING_TIMINGBASES_Msk      (0xf00UL)                 /*!< TIMINGBASES (Bitfield-Mask: 0x0f)                     */
#define MODEM_TIMING_ADDTIMSEQ_Pos        (12UL)                    /*!< ADDTIMSEQ (Bit 12)                                    */
#define MODEM_TIMING_ADDTIMSEQ_Msk        (0xf000UL)                /*!< ADDTIMSEQ (Bitfield-Mask: 0x0f)                       */
#define MODEM_TIMING_TIMSEQINVEN_Pos      (16UL)                    /*!< TIMSEQINVEN (Bit 16)                                  */
#define MODEM_TIMING_TIMSEQINVEN_Msk      (0x10000UL)               /*!< TIMSEQINVEN (Bitfield-Mask: 0x01)                     */
#define MODEM_TIMING_TIMSEQSYNC_Pos       (17UL)                    /*!< TIMSEQSYNC (Bit 17)                                   */
#define MODEM_TIMING_TIMSEQSYNC_Msk       (0x20000UL)               /*!< TIMSEQSYNC (Bitfield-Mask: 0x01)                      */
#define MODEM_TIMING_FDM0THRESH_Pos       (18UL)                    /*!< FDM0THRESH (Bit 18)                                   */
#define MODEM_TIMING_FDM0THRESH_Msk       (0x1c0000UL)              /*!< FDM0THRESH (Bitfield-Mask: 0x07)                      */
#define MODEM_TIMING_OFFSUBNUM_Pos        (21UL)                    /*!< OFFSUBNUM (Bit 21)                                    */
#define MODEM_TIMING_OFFSUBNUM_Msk        (0x1e00000UL)             /*!< OFFSUBNUM (Bitfield-Mask: 0x0f)                       */
#define MODEM_TIMING_OFFSUBDEN_Pos        (25UL)                    /*!< OFFSUBDEN (Bit 25)                                    */
#define MODEM_TIMING_OFFSUBDEN_Msk        (0x1e000000UL)            /*!< OFFSUBDEN (Bitfield-Mask: 0x0f)                       */
#define MODEM_TIMING_TSAGCDEL_Pos         (29UL)                    /*!< TSAGCDEL (Bit 29)                                     */
#define MODEM_TIMING_TSAGCDEL_Msk         (0x20000000UL)            /*!< TSAGCDEL (Bitfield-Mask: 0x01)                        */
#define MODEM_TIMING_FASTRESYNC_Pos       (30UL)                    /*!< FASTRESYNC (Bit 30)                                   */
#define MODEM_TIMING_FASTRESYNC_Msk       (0xc0000000UL)            /*!< FASTRESYNC (Bitfield-Mask: 0x03)                      */
/* =========================================================  DSSS0  ========================================================= */
#define MODEM_DSSS0_DSSS0_Pos             (0UL)                     /*!< DSSS0 (Bit 0)                                         */
#define MODEM_DSSS0_DSSS0_Msk             (0xffffffffUL)            /*!< DSSS0 (Bitfield-Mask: 0xffffffff)                     */
/* =======================================================  MODINDEX  ======================================================== */
#define MODEM_MODINDEX_MODINDEXM_Pos      (0UL)                     /*!< MODINDEXM (Bit 0)                                     */
#define MODEM_MODINDEX_MODINDEXM_Msk      (0x1fUL)                  /*!< MODINDEXM (Bitfield-Mask: 0x1f)                       */
#define MODEM_MODINDEX_MODINDEXE_Pos      (5UL)                     /*!< MODINDEXE (Bit 5)                                     */
#define MODEM_MODINDEX_MODINDEXE_Msk      (0x3e0UL)                 /*!< MODINDEXE (Bitfield-Mask: 0x1f)                       */
#define MODEM_MODINDEX_FREQGAINE_Pos      (16UL)                    /*!< FREQGAINE (Bit 16)                                    */
#define MODEM_MODINDEX_FREQGAINE_Msk      (0x70000UL)               /*!< FREQGAINE (Bitfield-Mask: 0x07)                       */
#define MODEM_MODINDEX_FREQGAINM_Pos      (19UL)                    /*!< FREQGAINM (Bit 19)                                    */
#define MODEM_MODINDEX_FREQGAINM_Msk      (0x380000UL)              /*!< FREQGAINM (Bitfield-Mask: 0x07)                       */
/* ==========================================================  AFC  ========================================================== */
#define MODEM_AFC_AFCSCALEM_Pos           (0UL)                     /*!< AFCSCALEM (Bit 0)                                     */
#define MODEM_AFC_AFCSCALEM_Msk           (0x1fUL)                  /*!< AFCSCALEM (Bitfield-Mask: 0x1f)                       */
#define MODEM_AFC_AFCSCALEE_Pos           (5UL)                     /*!< AFCSCALEE (Bit 5)                                     */
#define MODEM_AFC_AFCSCALEE_Msk           (0xe0UL)                  /*!< AFCSCALEE (Bitfield-Mask: 0x07)                       */
#define MODEM_AFC_AFCRXMODE_Pos           (10UL)                    /*!< AFCRXMODE (Bit 10)                                    */
#define MODEM_AFC_AFCRXMODE_Msk           (0x1c00UL)                /*!< AFCRXMODE (Bitfield-Mask: 0x07)                       */
#define MODEM_AFC_AFCTXMODE_Pos           (13UL)                    /*!< AFCTXMODE (Bit 13)                                    */
#define MODEM_AFC_AFCTXMODE_Msk           (0x6000UL)                /*!< AFCTXMODE (Bitfield-Mask: 0x03)                       */
#define MODEM_AFC_AFCRXCLR_Pos            (15UL)                    /*!< AFCRXCLR (Bit 15)                                     */
#define MODEM_AFC_AFCRXCLR_Msk            (0x8000UL)                /*!< AFCRXCLR (Bitfield-Mask: 0x01)                        */
#define MODEM_AFC_AFCDEL_Pos              (16UL)                    /*!< AFCDEL (Bit 16)                                       */
#define MODEM_AFC_AFCDEL_Msk              (0x1f0000UL)              /*!< AFCDEL (Bitfield-Mask: 0x1f)                          */
#define MODEM_AFC_AFCAVGPER_Pos           (21UL)                    /*!< AFCAVGPER (Bit 21)                                    */
#define MODEM_AFC_AFCAVGPER_Msk           (0xe00000UL)              /*!< AFCAVGPER (Bitfield-Mask: 0x07)                       */
/* =======================================================  AFCADJLIM  ======================================================= */
#define MODEM_AFCADJLIM_AFCADJLIM_Pos     (0UL)                     /*!< AFCADJLIM (Bit 0)                                     */
#define MODEM_AFCADJLIM_AFCADJLIM_Msk     (0x3ffffUL)               /*!< AFCADJLIM (Bitfield-Mask: 0x3ffff)                    */
/* =======================================================  SHAPING0  ======================================================== */
#define MODEM_SHAPING0_COEFF0_Pos         (0UL)                     /*!< COEFF0 (Bit 0)                                        */
#define MODEM_SHAPING0_COEFF0_Msk         (0xffUL)                  /*!< COEFF0 (Bitfield-Mask: 0xff)                          */
#define MODEM_SHAPING0_COEFF1_Pos         (8UL)                     /*!< COEFF1 (Bit 8)                                        */
#define MODEM_SHAPING0_COEFF1_Msk         (0xff00UL)                /*!< COEFF1 (Bitfield-Mask: 0xff)                          */
#define MODEM_SHAPING0_COEFF2_Pos         (16UL)                    /*!< COEFF2 (Bit 16)                                       */
#define MODEM_SHAPING0_COEFF2_Msk         (0xff0000UL)              /*!< COEFF2 (Bitfield-Mask: 0xff)                          */
#define MODEM_SHAPING0_COEFF3_Pos         (24UL)                    /*!< COEFF3 (Bit 24)                                       */
#define MODEM_SHAPING0_COEFF3_Msk         (0xff000000UL)            /*!< COEFF3 (Bitfield-Mask: 0xff)                          */
/* =======================================================  SHAPING1  ======================================================== */
#define MODEM_SHAPING1_COEFF4_Pos         (0UL)                     /*!< COEFF4 (Bit 0)                                        */
#define MODEM_SHAPING1_COEFF4_Msk         (0xffUL)                  /*!< COEFF4 (Bitfield-Mask: 0xff)                          */
#define MODEM_SHAPING1_COEFF5_Pos         (8UL)                     /*!< COEFF5 (Bit 8)                                        */
#define MODEM_SHAPING1_COEFF5_Msk         (0xff00UL)                /*!< COEFF5 (Bitfield-Mask: 0xff)                          */
#define MODEM_SHAPING1_COEFF6_Pos         (16UL)                    /*!< COEFF6 (Bit 16)                                       */
#define MODEM_SHAPING1_COEFF6_Msk         (0xff0000UL)              /*!< COEFF6 (Bitfield-Mask: 0xff)                          */
#define MODEM_SHAPING1_COEFF7_Pos         (24UL)                    /*!< COEFF7 (Bit 24)                                       */
#define MODEM_SHAPING1_COEFF7_Msk         (0xff000000UL)            /*!< COEFF7 (Bitfield-Mask: 0xff)                          */
/* =======================================================  SHAPING2  ======================================================== */
#define MODEM_SHAPING2_COEFF8_Pos         (0UL)                     /*!< COEFF8 (Bit 0)                                        */
#define MODEM_SHAPING2_COEFF8_Msk         (0xffUL)                  /*!< COEFF8 (Bitfield-Mask: 0xff)                          */
/* =======================================================  RAMPCTRL  ======================================================== */
#define MODEM_RAMPCTRL_RAMPRATE0_Pos      (0UL)                     /*!< RAMPRATE0 (Bit 0)                                     */
#define MODEM_RAMPCTRL_RAMPRATE0_Msk      (0xfUL)                   /*!< RAMPRATE0 (Bitfield-Mask: 0x0f)                       */
#define MODEM_RAMPCTRL_RAMPRATE0					(MODEM->RAMPCTRL & MODEM_RAMPCTRL_RAMPRATE0_Msk) >> MODEM_RAMPCTRL_RAMPRATE0_Pos
#define MODEM_RAMPCTRL_RAMPRATE1_Pos      (4UL)                     /*!< RAMPRATE1 (Bit 4)                                     */
#define MODEM_RAMPCTRL_RAMPRATE1_Msk      (0xf0UL)                  /*!< RAMPRATE1 (Bitfield-Mask: 0x0f)                       */
#define MODEM_RAMPCTRL_RAMPRATE1					(MODEM->RAMPCTRL & MODEM_RAMPCTRL_RAMPRATE1_Msk) >> MODEM_RAMPCTRL_RAMPRATE1_Pos
#define MODEM_RAMPCTRL_RAMPRATE2_Pos      (8UL)                     /*!< RAMPRATE2 (Bit 8)                                     */
#define MODEM_RAMPCTRL_RAMPRATE2_Msk      (0xf00UL)                 /*!< RAMPRATE2 (Bitfield-Mask: 0x0f)                       */
#define MODEM_RAMPCTRL_RAMPRATE2					(MODEM->RAMPCTRL & MODEM_RAMPCTRL_RAMPRATE2_Msk) >> MODEM_RAMPCTRL_RAMPRATE2_Pos
#define MODEM_RAMPCTRL_RAMPDIS_Pos        (23UL)                    /*!< RAMPDIS (Bit 23)                                      */
#define MODEM_RAMPCTRL_RAMPDIS_Msk        (0x800000UL)              /*!< RAMPDIS (Bitfield-Mask: 0x01)                         */
#define MODEM_RAMPCTRL_RAMPVAL_Pos        (24UL)                    /*!< RAMPVAL (Bit 24)                                      */
#define MODEM_RAMPCTRL_RAMPVAL_Msk        (0xff000000UL)            /*!< RAMPVAL (Bitfield-Mask: 0xff)                         */
/* ========================================================  RAMPLEV  ======================================================== */
#define MODEM_RAMPLEV_RAMPLEV0_Pos        (0UL)                     /*!< RAMPLEV0 (Bit 0)                                      */
#define MODEM_RAMPLEV_RAMPLEV0_Msk        (0xffUL)                  /*!< RAMPLEV0 (Bitfield-Mask: 0xff)                        */
#define MODEM_RAMPLEV_RAMPLEV0						(MODEM->RAMPLEV & MODEM_RAMPLEV_RAMPLEV0_Msk) >> MODEM_RAMPLEV_RAMPLEV0_Pos
#define MODEM_RAMPLEV_RAMPLEV1_Pos        (8UL)                     /*!< RAMPLEV1 (Bit 8)                                      */
#define MODEM_RAMPLEV_RAMPLEV1_Msk        (0xff00UL)                /*!< RAMPLEV1 (Bitfield-Mask: 0xff)                        */
#define MODEM_RAMPLEV_RAMPLEV1						(MODEM->RAMPLEV & MODEM_RAMPLEV_RAMPLEV1_Msk) >> MODEM_RAMPLEV_RAMPLEV1_Pos
#define MODEM_RAMPLEV_RAMPLEV2_Pos        (16UL)                    /*!< RAMPLEV2 (Bit 16)                                     */
#define MODEM_RAMPLEV_RAMPLEV2_Msk        (0xff0000UL)              /*!< RAMPLEV2 (Bitfield-Mask: 0xff)                        */
#define MODEM_RAMPLEV_RAMPLEV2						(MODEM->RAMPLEV & MODEM_RAMPLEV_RAMPLEV2_Msk) >> MODEM_RAMPLEV_RAMPLEV2_Pos
/* =======================================================  ROUTEPEN  ======================================================== */
#define MODEM_ROUTEPEN_DINPEN_Pos         (0UL)                     /*!< DINPEN (Bit 0)                                        */
#define MODEM_ROUTEPEN_DINPEN_Msk         (0x1UL)                   /*!< DINPEN (Bitfield-Mask: 0x01)                          */
#define MODEM_ROUTEPEN_DOUTPEN_Pos        (1UL)                     /*!< DOUTPEN (Bit 1)                                       */
#define MODEM_ROUTEPEN_DOUTPEN_Msk        (0x2UL)                   /*!< DOUTPEN (Bitfield-Mask: 0x01)                         */
#define MODEM_ROUTEPEN_DCLKPEN_Pos        (2UL)                     /*!< DCLKPEN (Bit 2)                                       */
#define MODEM_ROUTEPEN_DCLKPEN_Msk        (0x4UL)                   /*!< DCLKPEN (Bitfield-Mask: 0x01)                         */
#define MODEM_ROUTEPEN_ANT0PEN_Pos        (3UL)                     /*!< ANT0PEN (Bit 3)                                       */
#define MODEM_ROUTEPEN_ANT0PEN_Msk        (0x8UL)                   /*!< ANT0PEN (Bitfield-Mask: 0x01)                         */
#define MODEM_ROUTEPEN_ANT1PEN_Pos        (4UL)                     /*!< ANT1PEN (Bit 4)                                       */
#define MODEM_ROUTEPEN_ANT1PEN_Msk        (0x10UL)                  /*!< ANT1PEN (Bitfield-Mask: 0x01)                         */
/* =======================================================  ROUTELOC0  ======================================================= */
#define MODEM_ROUTELOC0_DINLOC_Pos        (0UL)                     /*!< DINLOC (Bit 0)                                        */
#define MODEM_ROUTELOC0_DINLOC_Msk        (0x3fUL)                  /*!< DINLOC (Bitfield-Mask: 0x3f)                          */
#define MODEM_ROUTELOC0_DOUTLOC_Pos       (8UL)                     /*!< DOUTLOC (Bit 8)                                       */
#define MODEM_ROUTELOC0_DOUTLOC_Msk       (0x3f00UL)                /*!< DOUTLOC (Bitfield-Mask: 0x3f)                         */
#define MODEM_ROUTELOC0_DCLKLOC_Pos       (16UL)                    /*!< DCLKLOC (Bit 16)                                      */
#define MODEM_ROUTELOC0_DCLKLOC_Msk       (0x3f0000UL)              /*!< DCLKLOC (Bitfield-Mask: 0x3f)                         */
/* =======================================================  ROUTELOC1  ======================================================= */
#define MODEM_ROUTELOC1_ANT0LOC_Pos       (0UL)                     /*!< ANT0LOC (Bit 0)                                       */
#define MODEM_ROUTELOC1_ANT0LOC_Msk       (0x3fUL)                  /*!< ANT0LOC (Bitfield-Mask: 0x3f)                         */
#define MODEM_ROUTELOC1_ANT1LOC_Pos       (8UL)                     /*!< ANT1LOC (Bit 8)                                       */
#define MODEM_ROUTELOC1_ANT1LOC_Msk       (0x3f00UL)                /*!< ANT1LOC (Bitfield-Mask: 0x3f)                         */
/* ==========================================================  IF  =========================================================== */
#define MODEM_IF_TXFRAMESENT_Pos          (0UL)                     /*!< TXFRAMESENT (Bit 0)                                   */
#define MODEM_IF_TXFRAMESENT_Msk          (0x1UL)                   /*!< TXFRAMESENT (Bitfield-Mask: 0x01)                     */
#define MODEM_IF_TXSYNCSENT_Pos           (1UL)                     /*!< TXSYNCSENT (Bit 1)                                    */
#define MODEM_IF_TXSYNCSENT_Msk           (0x2UL)                   /*!< TXSYNCSENT (Bitfield-Mask: 0x01)                      */
#define MODEM_IF_TXPRESENT_Pos            (2UL)                     /*!< TXPRESENT (Bit 2)                                     */
#define MODEM_IF_TXPRESENT_Msk            (0x4UL)                   /*!< TXPRESENT (Bitfield-Mask: 0x01)                       */
#define MODEM_IF_RXTIMDET_Pos             (8UL)                     /*!< RXTIMDET (Bit 8)                                      */
#define MODEM_IF_RXTIMDET_Msk             (0x100UL)                 /*!< RXTIMDET (Bitfield-Mask: 0x01)                        */
#define MODEM_IF_RXPREDET_Pos             (9UL)                     /*!< RXPREDET (Bit 9)                                      */
#define MODEM_IF_RXPREDET_Msk             (0x200UL)                 /*!< RXPREDET (Bitfield-Mask: 0x01)                        */
#define MODEM_IF_RXFRAMEDET0_Pos          (10UL)                    /*!< RXFRAMEDET0 (Bit 10)                                  */
#define MODEM_IF_RXFRAMEDET0_Msk          (0x400UL)                 /*!< RXFRAMEDET0 (Bitfield-Mask: 0x01)                     */
#define MODEM_IF_RXFRAMEDET1_Pos          (11UL)                    /*!< RXFRAMEDET1 (Bit 11)                                  */
#define MODEM_IF_RXFRAMEDET1_Msk          (0x800UL)                 /*!< RXFRAMEDET1 (Bitfield-Mask: 0x01)                     */
#define MODEM_IF_RXTIMLOST_Pos            (12UL)                    /*!< RXTIMLOST (Bit 12)                                    */
#define MODEM_IF_RXTIMLOST_Msk            (0x1000UL)                /*!< RXTIMLOST (Bitfield-Mask: 0x01)                       */
#define MODEM_IF_RXPRELOST_Pos            (13UL)                    /*!< RXPRELOST (Bit 13)                                    */
#define MODEM_IF_RXPRELOST_Msk            (0x2000UL)                /*!< RXPRELOST (Bitfield-Mask: 0x01)                       */
#define MODEM_IF_RXFRAMEDETOF_Pos         (14UL)                    /*!< RXFRAMEDETOF (Bit 14)                                 */
#define MODEM_IF_RXFRAMEDETOF_Msk         (0x4000UL)                /*!< RXFRAMEDETOF (Bitfield-Mask: 0x01)                    */
#define MODEM_IF_RXTIMNF_Pos              (15UL)                    /*!< RXTIMNF (Bit 15)                                      */
