VDowbensky/efr32_baremetal/baremetal_test/device/efr32fg1v_modem_1.h
#define MODEM_IF_RXTIMNF_Msk              (0x8000UL)                /*!< RXTIMNF (Bitfield-Mask: 0x01)                         */
/* ==========================================================  IFS  ========================================================== */
#define MODEM_IFS_TXFRAMESENT_Pos         (0UL)                     /*!< TXFRAMESENT (Bit 0)                                   */
#define MODEM_IFS_TXFRAMESENT_Msk         (0x1UL)                   /*!< TXFRAMESENT (Bitfield-Mask: 0x01)                     */
#define MODEM_IFS_TXSYNCSENT_Pos          (1UL)                     /*!< TXSYNCSENT (Bit 1)                                    */
#define MODEM_IFS_TXSYNCSENT_Msk          (0x2UL)                   /*!< TXSYNCSENT (Bitfield-Mask: 0x01)                      */
#define MODEM_IFS_TXPRESENT_Pos           (2UL)                     /*!< TXPRESENT (Bit 2)                                     */
#define MODEM_IFS_TXPRESENT_Msk           (0x4UL)                   /*!< TXPRESENT (Bitfield-Mask: 0x01)                       */
#define MODEM_IFS_RXTIMDET_Pos            (8UL)                     /*!< RXTIMDET (Bit 8)                                      */
#define MODEM_IFS_RXTIMDET_Msk            (0x100UL)                 /*!< RXTIMDET (Bitfield-Mask: 0x01)                        */
#define MODEM_IFS_RXPREDET_Pos            (9UL)                     /*!< RXPREDET (Bit 9)                                      */
#define MODEM_IFS_RXPREDET_Msk            (0x200UL)                 /*!< RXPREDET (Bitfield-Mask: 0x01)                        */
#define MODEM_IFS_RXFRAMEDET0_Pos         (10UL)                    /*!< RXFRAMEDET0 (Bit 10)                                  */
#define MODEM_IFS_RXFRAMEDET0_Msk         (0x400UL)                 /*!< RXFRAMEDET0 (Bitfield-Mask: 0x01)                     */
#define MODEM_IFS_RXFRAMEDET1_Pos         (11UL)                    /*!< RXFRAMEDET1 (Bit 11)                                  */
#define MODEM_IFS_RXFRAMEDET1_Msk         (0x800UL)                 /*!< RXFRAMEDET1 (Bitfield-Mask: 0x01)                     */
#define MODEM_IFS_RXTIMLOST_Pos           (12UL)                    /*!< RXTIMLOST (Bit 12)                                    */
#define MODEM_IFS_RXTIMLOST_Msk           (0x1000UL)                /*!< RXTIMLOST (Bitfield-Mask: 0x01)                       */
#define MODEM_IFS_RXPRELOST_Pos           (13UL)                    /*!< RXPRELOST (Bit 13)                                    */
#define MODEM_IFS_RXPRELOST_Msk           (0x2000UL)                /*!< RXPRELOST (Bitfield-Mask: 0x01)                       */
#define MODEM_IFS_RXFRAMEDETOF_Pos        (14UL)                    /*!< RXFRAMEDETOF (Bit 14)                                 */
#define MODEM_IFS_RXFRAMEDETOF_Msk        (0x4000UL)                /*!< RXFRAMEDETOF (Bitfield-Mask: 0x01)                    */
#define MODEM_IFS_RXTIMNF_Pos             (15UL)                    /*!< RXTIMNF (Bit 15)                                      */
#define MODEM_IFS_RXTIMNF_Msk             (0x8000UL)                /*!< RXTIMNF (Bitfield-Mask: 0x01)                         */
/* ==========================================================  IFC  ========================================================== */
#define MODEM_IFC_TXFRAMESENT_Pos         (0UL)                     /*!< TXFRAMESENT (Bit 0)                                   */
#define MODEM_IFC_TXFRAMESENT_Msk         (0x1UL)                   /*!< TXFRAMESENT (Bitfield-Mask: 0x01)                     */
#define MODEM_IFC_TXSYNCSENT_Pos          (1UL)                     /*!< TXSYNCSENT (Bit 1)                                    */
#define MODEM_IFC_TXSYNCSENT_Msk          (0x2UL)                   /*!< TXSYNCSENT (Bitfield-Mask: 0x01)                      */
#define MODEM_IFC_TXPRESENT_Pos           (2UL)                     /*!< TXPRESENT (Bit 2)                                     */
#define MODEM_IFC_TXPRESENT_Msk           (0x4UL)                   /*!< TXPRESENT (Bitfield-Mask: 0x01)                       */
#define MODEM_IFC_RXTIMDET_Pos            (8UL)                     /*!< RXTIMDET (Bit 8)                                      */
#define MODEM_IFC_RXTIMDET_Msk            (0x100UL)                 /*!< RXTIMDET (Bitfield-Mask: 0x01)                        */
#define MODEM_IFC_RXPREDET_Pos            (9UL)                     /*!< RXPREDET (Bit 9)                                      */
#define MODEM_IFC_RXPREDET_Msk            (0x200UL)                 /*!< RXPREDET (Bitfield-Mask: 0x01)                        */
#define MODEM_IFC_RXFRAMEDET0_Pos         (10UL)                    /*!< RXFRAMEDET0 (Bit 10)                                  */
#define MODEM_IFC_RXFRAMEDET0_Msk         (0x400UL)                 /*!< RXFRAMEDET0 (Bitfield-Mask: 0x01)                     */
#define MODEM_IFC_RXFRAMEDET1_Pos         (11UL)                    /*!< RXFRAMEDET1 (Bit 11)                                  */
#define MODEM_IFC_RXFRAMEDET1_Msk         (0x800UL)                 /*!< RXFRAMEDET1 (Bitfield-Mask: 0x01)                     */
#define MODEM_IFC_RXTIMLOST_Pos           (12UL)                    /*!< RXTIMLOST (Bit 12)                                    */
#define MODEM_IFC_RXTIMLOST_Msk           (0x1000UL)                /*!< RXTIMLOST (Bitfield-Mask: 0x01)                       */
#define MODEM_IFC_RXPRELOST_Pos           (13UL)                    /*!< RXPRELOST (Bit 13)                                    */
#define MODEM_IFC_RXPRELOST_Msk           (0x2000UL)                /*!< RXPRELOST (Bitfield-Mask: 0x01)                       */
#define MODEM_IFC_RXFRAMEDETOF_Pos        (14UL)                    /*!< RXFRAMEDETOF (Bit 14)                                 */
#define MODEM_IFC_RXFRAMEDETOF_Msk        (0x4000UL)                /*!< RXFRAMEDETOF (Bitfield-Mask: 0x01)                    */
#define MODEM_IFC_RXTIMNF_Pos             (15UL)                    /*!< RXTIMNF (Bit 15)                                      */
#define MODEM_IFC_RXTIMNF_Msk             (0x8000UL)                /*!< RXTIMNF (Bitfield-Mask: 0x01)                         */
/* ==========================================================  IEN  ========================================================== */
#define MODEM_IEN_TXFRAMESENT_Pos         (0UL)                     /*!< TXFRAMESENT (Bit 0)                                   */
#define MODEM_IEN_TXFRAMESENT_Msk         (0x1UL)                   /*!< TXFRAMESENT (Bitfield-Mask: 0x01)                     */
#define MODEM_IEN_TXSYNCSENT_Pos          (1UL)                     /*!< TXSYNCSENT (Bit 1)                                    */
#define MODEM_IEN_TXSYNCSENT_Msk          (0x2UL)                   /*!< TXSYNCSENT (Bitfield-Mask: 0x01)                      */
#define MODEM_IEN_TXPRESENT_Pos           (2UL)                     /*!< TXPRESENT (Bit 2)                                     */
#define MODEM_IEN_TXPRESENT_Msk           (0x4UL)                   /*!< TXPRESENT (Bitfield-Mask: 0x01)                       */
#define MODEM_IEN_RXTIMDET_Pos            (8UL)                     /*!< RXTIMDET (Bit 8)                                      */
#define MODEM_IEN_RXTIMDET_Msk            (0x100UL)                 /*!< RXTIMDET (Bitfield-Mask: 0x01)                        */
#define MODEM_IEN_RXPREDET_Pos            (9UL)                     /*!< RXPREDET (Bit 9)                                      */
#define MODEM_IEN_RXPREDET_Msk            (0x200UL)                 /*!< RXPREDET (Bitfield-Mask: 0x01)                        */
#define MODEM_IEN_RXFRAMEDET0_Pos         (10UL)                    /*!< RXFRAMEDET0 (Bit 10)                                  */
#define MODEM_IEN_RXFRAMEDET0_Msk         (0x400UL)                 /*!< RXFRAMEDET0 (Bitfield-Mask: 0x01)                     */
#define MODEM_IEN_RXFRAMEDET1_Pos         (11UL)                    /*!< RXFRAMEDET1 (Bit 11)                                  */
#define MODEM_IEN_RXFRAMEDET1_Msk         (0x800UL)                 /*!< RXFRAMEDET1 (Bitfield-Mask: 0x01)                     */
#define MODEM_IEN_RXTIMLOST_Pos           (12UL)                    /*!< RXTIMLOST (Bit 12)                                    */
#define MODEM_IEN_RXTIMLOST_Msk           (0x1000UL)                /*!< RXTIMLOST (Bitfield-Mask: 0x01)                       */
#define MODEM_IEN_RXPRELOST_Pos           (13UL)                    /*!< RXPRELOST (Bit 13)                                    */
#define MODEM_IEN_RXPRELOST_Msk           (0x2000UL)                /*!< RXPRELOST (Bitfield-Mask: 0x01)                       */
#define MODEM_IEN_RXFRAMEDETOF_Pos        (14UL)                    /*!< RXFRAMEDETOF (Bit 14)                                 */
#define MODEM_IEN_RXFRAMEDETOF_Msk        (0x4000UL)                /*!< RXFRAMEDETOF (Bitfield-Mask: 0x01)                    */
#define MODEM_IEN_RXTIMNF_Pos             (15UL)                    /*!< RXTIMNF (Bit 15)                                      */
#define MODEM_IEN_RXTIMNF_Msk             (0x8000UL)                /*!< RXTIMNF (Bitfield-Mask: 0x01)                         */
/* ==========================================================  CMD  ========================================================== */
#define MODEM_CMD_PRESTOP_Pos             (0UL)                     /*!< PRESTOP (Bit 0)                                       */
#define MODEM_CMD_PRESTOP_Msk             (0x1UL)                   /*!< PRESTOP (Bitfield-Mask: 0x01)                         */
#define MODEM_CMD_AFCTXLOCK_Pos           (3UL)                     /*!< AFCTXLOCK (Bit 3)                                     */
#define MODEM_CMD_AFCTXLOCK_Msk           (0x8UL)                   /*!< AFCTXLOCK (Bitfield-Mask: 0x01)                       */
#define MODEM_CMD_AFCTXCLEAR_Pos          (5UL)                     /*!< AFCTXCLEAR (Bit 5)                                    */
#define MODEM_CMD_AFCTXCLEAR_Msk          (0x20UL)                  /*!< AFCTXCLEAR (Bitfield-Mask: 0x01)                      */
#define MODEM_CMD_AFCRXCLEAR_Pos          (4UL)                     /*!< AFCRXCLEAR (Bit 4)                                    */
#define MODEM_CMD_AFCRXCLEAR_Msk          (0x10UL)                  /*!< AFCRXCLEAR (Bitfield-Mask: 0x01)                      */
/* ========================================================  DCCOMP  ========================================================= */
#define MODEM_DCCOMP_DCESTIEN_Pos         (0UL)                     /*!< DCESTIEN (Bit 0)                                      */
#define MODEM_DCCOMP_DCESTIEN_Msk         (0x1UL)                   /*!< DCESTIEN (Bitfield-Mask: 0x01)                        */
#define MODEM_DCCOMP_DCCOMPEN_Pos         (1UL)                     /*!< DCCOMPEN (Bit 1)                                      */
#define MODEM_DCCOMP_DCCOMPEN_Msk         (0x2UL)                   /*!< DCCOMPEN (Bitfield-Mask: 0x01)                        */
#define MODEM_DCCOMP_DCRSTEN_Pos          (2UL)                     /*!< DCRSTEN (Bit 2)                                       */
#define MODEM_DCCOMP_DCRSTEN_Msk          (0x4UL)                   /*!< DCRSTEN (Bitfield-Mask: 0x01)                         */
#define MODEM_DCCOMP_DCCOMPFREEZE_Pos     (3UL)                     /*!< DCCOMPFREEZE (Bit 3)                                  */
#define MODEM_DCCOMP_DCCOMPFREEZE_Msk     (0x8UL)                   /*!< DCCOMPFREEZE (Bitfield-Mask: 0x01)                    */
#define MODEM_DCCOMP_DCCOMPGEAR_Pos       (4UL)                     /*!< DCCOMPGEAR (Bit 4)                                    */
#define MODEM_DCCOMP_DCCOMPGEAR_Msk       (0x70UL)                  /*!< DCCOMPGEAR (Bitfield-Mask: 0x07)                      */
#define MODEM_DCCOMP_DCLIMIT_Pos          (7UL)                     /*!< DCLIMIT (Bit 7)                                       */
#define MODEM_DCCOMP_DCLIMIT_Msk          (0x180UL)                 /*!< DCLIMIT (Bitfield-Mask: 0x03)                         */
/* ====================================================  DCCOMPFILTINIT  ===================================================== */
#define MODEM_DCCOMPFILTINIT_DCCOMPINITVALI_Pos (0UL)               /*!< DCCOMPINITVALI (Bit 0)                                */
#define MODEM_DCCOMPFILTINIT_DCCOMPINITVALI_Msk (0x7fffUL)          /*!< DCCOMPINITVALI (Bitfield-Mask: 0x7fff)                */
#define MODEM_DCCOMPFILTINIT_DCCOMPINITVALQ_Pos (15UL)              /*!< DCCOMPINITVALQ (Bit 15)                               */
#define MODEM_DCCOMPFILTINIT_DCCOMPINITVALQ_Msk (0x3fff8000UL)      /*!< DCCOMPINITVALQ (Bitfield-Mask: 0x7fff)                */
#define MODEM_DCCOMPFILTINIT_DCCOMPINIT_Pos (30UL)                  /*!< DCCOMPINIT (Bit 30)                                   */
#define MODEM_DCCOMPFILTINIT_DCCOMPINIT_Msk (0x40000000UL)          /*!< DCCOMPINIT (Bitfield-Mask: 0x01)                      */
/* ========================================================  DCESTI  ========================================================= */
#define MODEM_DCESTI_DCCOMPESTIVALI_Pos   (0UL)                     /*!< DCCOMPESTIVALI (Bit 0)                                */
#define MODEM_DCESTI_DCCOMPESTIVALI_Msk   (0x7fffUL)                /*!< DCCOMPESTIVALI (Bitfield-Mask: 0x7fff)                */
#define MODEM_DCESTI_DCCOMPESTIVALQ_Pos   (15UL)                    /*!< DCCOMPESTIVALQ (Bit 15)                               */
#define MODEM_DCESTI_DCCOMPESTIVALQ_Msk   (0x3fff8000UL)            /*!< DCCOMPESTIVALQ (Bitfield-Mask: 0x7fff)                */
/* =====================================================  RAM0_RAMDATA  ====================================================== */
#define MODEM_RAM0_RAMDATA_DATA_Pos       (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM0_RAMDATA_DATA_Msk       (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* =====================================================  RAM1_RAMDATA  ====================================================== */
#define MODEM_RAM1_RAMDATA_DATA_Pos       (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM1_RAMDATA_DATA_Msk       (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* =====================================================  RAM2_RAMDATA  ====================================================== */
#define MODEM_RAM2_RAMDATA_DATA_Pos       (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM2_RAMDATA_DATA_Msk       (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* =====================================================  RAM3_RAMDATA  ====================================================== */
#define MODEM_RAM3_RAMDATA_DATA_Pos       (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM3_RAMDATA_DATA_Msk       (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* =====================================================  RAM4_RAMDATA  ====================================================== */
#define MODEM_RAM4_RAMDATA_DATA_Pos       (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM4_RAMDATA_DATA_Msk       (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* =====================================================  RAM5_RAMDATA  ====================================================== */
#define MODEM_RAM5_RAMDATA_DATA_Pos       (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM5_RAMDATA_DATA_Msk       (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* =====================================================  RAM6_RAMDATA  ====================================================== */
#define MODEM_RAM6_RAMDATA_DATA_Pos       (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM6_RAMDATA_DATA_Msk       (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* =====================================================  RAM7_RAMDATA  ====================================================== */
#define MODEM_RAM7_RAMDATA_DATA_Pos       (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM7_RAMDATA_DATA_Msk       (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* =====================================================  RAM8_RAMDATA  ====================================================== */
#define MODEM_RAM8_RAMDATA_DATA_Pos       (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM8_RAMDATA_DATA_Msk       (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* =====================================================  RAM9_RAMDATA  ====================================================== */
#define MODEM_RAM9_RAMDATA_DATA_Pos       (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM9_RAMDATA_DATA_Msk       (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* =====================================================  RAM10_RAMDATA  ===================================================== */
#define MODEM_RAM10_RAMDATA_DATA_Pos      (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM10_RAMDATA_DATA_Msk      (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* =====================================================  RAM11_RAMDATA  ===================================================== */
#define MODEM_RAM11_RAMDATA_DATA_Pos      (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM11_RAMDATA_DATA_Msk      (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* =====================================================  RAM12_RAMDATA  ===================================================== */
#define MODEM_RAM12_RAMDATA_DATA_Pos      (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM12_RAMDATA_DATA_Msk      (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* =====================================================  RAM13_RAMDATA  ===================================================== */
#define MODEM_RAM13_RAMDATA_DATA_Pos      (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM13_RAMDATA_DATA_Msk      (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* =====================================================  RAM14_RAMDATA  ===================================================== */
#define MODEM_RAM14_RAMDATA_DATA_Pos      (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM14_RAMDATA_DATA_Msk      (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* =====================================================  RAM15_RAMDATA  ===================================================== */
#define MODEM_RAM15_RAMDATA_DATA_Pos      (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM15_RAMDATA_DATA_Msk      (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* =====================================================  RAM16_RAMDATA  ===================================================== */
#define MODEM_RAM16_RAMDATA_DATA_Pos      (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM16_RAMDATA_DATA_Msk      (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* =====================================================  RAM17_RAMDATA  ===================================================== */
#define MODEM_RAM17_RAMDATA_DATA_Pos      (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM17_RAMDATA_DATA_Msk      (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* =====================================================  RAM18_RAMDATA  ===================================================== */
#define MODEM_RAM18_RAMDATA_DATA_Pos      (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM18_RAMDATA_DATA_Msk      (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* =====================================================  RAM19_RAMDATA  ===================================================== */
#define MODEM_RAM19_RAMDATA_DATA_Pos      (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM19_RAMDATA_DATA_Msk      (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* =====================================================  RAM20_RAMDATA  ===================================================== */
#define MODEM_RAM20_RAMDATA_DATA_Pos      (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM20_RAMDATA_DATA_Msk      (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* =====================================================  RAM21_RAMDATA  ===================================================== */
#define MODEM_RAM21_RAMDATA_DATA_Pos      (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM21_RAMDATA_DATA_Msk      (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* =====================================================  RAM22_RAMDATA  ===================================================== */
#define MODEM_RAM22_RAMDATA_DATA_Pos      (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM22_RAMDATA_DATA_Msk      (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* =====================================================  RAM23_RAMDATA  ===================================================== */
#define MODEM_RAM23_RAMDATA_DATA_Pos      (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM23_RAMDATA_DATA_Msk      (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* =====================================================  RAM24_RAMDATA  ===================================================== */
#define MODEM_RAM24_RAMDATA_DATA_Pos      (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM24_RAMDATA_DATA_Msk      (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* =====================================================  RAM25_RAMDATA  ===================================================== */
#define MODEM_RAM25_RAMDATA_DATA_Pos      (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM25_RAMDATA_DATA_Msk      (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* =====================================================  RAM26_RAMDATA  ===================================================== */
#define MODEM_RAM26_RAMDATA_DATA_Pos      (0UL)                     /*!< DATA (Bit 0)                                          */
