VDowbensky/efr32_baremetal/baremetal_test/device/efr32fg1v_modem_1.h
/* =====================================================  RAM88_RAMDATA  ===================================================== */
#define MODEM_RAM88_RAMDATA_DATA_Pos      (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM88_RAMDATA_DATA_Msk      (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* =====================================================  RAM89_RAMDATA  ===================================================== */
#define MODEM_RAM89_RAMDATA_DATA_Pos      (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM89_RAMDATA_DATA_Msk      (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* =====================================================  RAM90_RAMDATA  ===================================================== */
#define MODEM_RAM90_RAMDATA_DATA_Pos      (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM90_RAMDATA_DATA_Msk      (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* =====================================================  RAM91_RAMDATA  ===================================================== */
#define MODEM_RAM91_RAMDATA_DATA_Pos      (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM91_RAMDATA_DATA_Msk      (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* =====================================================  RAM92_RAMDATA  ===================================================== */
#define MODEM_RAM92_RAMDATA_DATA_Pos      (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM92_RAMDATA_DATA_Msk      (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* =====================================================  RAM93_RAMDATA  ===================================================== */
#define MODEM_RAM93_RAMDATA_DATA_Pos      (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM93_RAMDATA_DATA_Msk      (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* =====================================================  RAM94_RAMDATA  ===================================================== */
#define MODEM_RAM94_RAMDATA_DATA_Pos      (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM94_RAMDATA_DATA_Msk      (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* =====================================================  RAM95_RAMDATA  ===================================================== */
#define MODEM_RAM95_RAMDATA_DATA_Pos      (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM95_RAMDATA_DATA_Msk      (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* =====================================================  RAM96_RAMDATA  ===================================================== */
#define MODEM_RAM96_RAMDATA_DATA_Pos      (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM96_RAMDATA_DATA_Msk      (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* =====================================================  RAM97_RAMDATA  ===================================================== */
#define MODEM_RAM97_RAMDATA_DATA_Pos      (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM97_RAMDATA_DATA_Msk      (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* =====================================================  RAM98_RAMDATA  ===================================================== */
#define MODEM_RAM98_RAMDATA_DATA_Pos      (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM98_RAMDATA_DATA_Msk      (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* =====================================================  RAM99_RAMDATA  ===================================================== */
#define MODEM_RAM99_RAMDATA_DATA_Pos      (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM99_RAMDATA_DATA_Msk      (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* ====================================================  RAM100_RAMDATA  ===================================================== */
#define MODEM_RAM100_RAMDATA_DATA_Pos     (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM100_RAMDATA_DATA_Msk     (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* ====================================================  RAM101_RAMDATA  ===================================================== */
#define MODEM_RAM101_RAMDATA_DATA_Pos     (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM101_RAMDATA_DATA_Msk     (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* ====================================================  RAM102_RAMDATA  ===================================================== */
#define MODEM_RAM102_RAMDATA_DATA_Pos     (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM102_RAMDATA_DATA_Msk     (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* ====================================================  RAM103_RAMDATA  ===================================================== */
#define MODEM_RAM103_RAMDATA_DATA_Pos     (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM103_RAMDATA_DATA_Msk     (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* ====================================================  RAM104_RAMDATA  ===================================================== */
#define MODEM_RAM104_RAMDATA_DATA_Pos     (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM104_RAMDATA_DATA_Msk     (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* ====================================================  RAM105_RAMDATA  ===================================================== */
#define MODEM_RAM105_RAMDATA_DATA_Pos     (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM105_RAMDATA_DATA_Msk     (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* ====================================================  RAM106_RAMDATA  ===================================================== */
#define MODEM_RAM106_RAMDATA_DATA_Pos     (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM106_RAMDATA_DATA_Msk     (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* ====================================================  RAM107_RAMDATA  ===================================================== */
#define MODEM_RAM107_RAMDATA_DATA_Pos     (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM107_RAMDATA_DATA_Msk     (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* ====================================================  RAM108_RAMDATA  ===================================================== */
#define MODEM_RAM108_RAMDATA_DATA_Pos     (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM108_RAMDATA_DATA_Msk     (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* ====================================================  RAM109_RAMDATA  ===================================================== */
#define MODEM_RAM109_RAMDATA_DATA_Pos     (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM109_RAMDATA_DATA_Msk     (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* ====================================================  RAM110_RAMDATA  ===================================================== */
#define MODEM_RAM110_RAMDATA_DATA_Pos     (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM110_RAMDATA_DATA_Msk     (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* ====================================================  RAM111_RAMDATA  ===================================================== */
#define MODEM_RAM111_RAMDATA_DATA_Pos     (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM111_RAMDATA_DATA_Msk     (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* ====================================================  RAM112_RAMDATA  ===================================================== */
#define MODEM_RAM112_RAMDATA_DATA_Pos     (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM112_RAMDATA_DATA_Msk     (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* ====================================================  RAM113_RAMDATA  ===================================================== */
#define MODEM_RAM113_RAMDATA_DATA_Pos     (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM113_RAMDATA_DATA_Msk     (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* ====================================================  RAM114_RAMDATA  ===================================================== */
#define MODEM_RAM114_RAMDATA_DATA_Pos     (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM114_RAMDATA_DATA_Msk     (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* ====================================================  RAM115_RAMDATA  ===================================================== */
#define MODEM_RAM115_RAMDATA_DATA_Pos     (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM115_RAMDATA_DATA_Msk     (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* ====================================================  RAM116_RAMDATA  ===================================================== */
#define MODEM_RAM116_RAMDATA_DATA_Pos     (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM116_RAMDATA_DATA_Msk     (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* ====================================================  RAM117_RAMDATA  ===================================================== */
#define MODEM_RAM117_RAMDATA_DATA_Pos     (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM117_RAMDATA_DATA_Msk     (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* ====================================================  RAM118_RAMDATA  ===================================================== */
#define MODEM_RAM118_RAMDATA_DATA_Pos     (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM118_RAMDATA_DATA_Msk     (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* ====================================================  RAM119_RAMDATA  ===================================================== */
#define MODEM_RAM119_RAMDATA_DATA_Pos     (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM119_RAMDATA_DATA_Msk     (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* ====================================================  RAM120_RAMDATA  ===================================================== */
#define MODEM_RAM120_RAMDATA_DATA_Pos     (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM120_RAMDATA_DATA_Msk     (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* ====================================================  RAM121_RAMDATA  ===================================================== */
#define MODEM_RAM121_RAMDATA_DATA_Pos     (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM121_RAMDATA_DATA_Msk     (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* ====================================================  RAM122_RAMDATA  ===================================================== */
#define MODEM_RAM122_RAMDATA_DATA_Pos     (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM122_RAMDATA_DATA_Msk     (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* ====================================================  RAM123_RAMDATA  ===================================================== */
#define MODEM_RAM123_RAMDATA_DATA_Pos     (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM123_RAMDATA_DATA_Msk     (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* ====================================================  RAM124_RAMDATA  ===================================================== */
#define MODEM_RAM124_RAMDATA_DATA_Pos     (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM124_RAMDATA_DATA_Msk     (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* ====================================================  RAM125_RAMDATA  ===================================================== */
#define MODEM_RAM125_RAMDATA_DATA_Pos     (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM125_RAMDATA_DATA_Msk     (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* ====================================================  RAM126_RAMDATA  ===================================================== */
#define MODEM_RAM126_RAMDATA_DATA_Pos     (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM126_RAMDATA_DATA_Msk     (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* ====================================================  RAM127_RAMDATA  ===================================================== */
#define MODEM_RAM127_RAMDATA_DATA_Pos     (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM127_RAMDATA_DATA_Msk     (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* ====================================================  RAM128_RAMDATA  ===================================================== */
#define MODEM_RAM128_RAMDATA_DATA_Pos     (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM128_RAMDATA_DATA_Msk     (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* ====================================================  RAM129_RAMDATA  ===================================================== */
#define MODEM_RAM129_RAMDATA_DATA_Pos     (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM129_RAMDATA_DATA_Msk     (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* ====================================================  RAM130_RAMDATA  ===================================================== */
#define MODEM_RAM130_RAMDATA_DATA_Pos     (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM130_RAMDATA_DATA_Msk     (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* ====================================================  RAM131_RAMDATA  ===================================================== */
#define MODEM_RAM131_RAMDATA_DATA_Pos     (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM131_RAMDATA_DATA_Msk     (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* ====================================================  RAM132_RAMDATA  ===================================================== */
#define MODEM_RAM132_RAMDATA_DATA_Pos     (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM132_RAMDATA_DATA_Msk     (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* ====================================================  RAM133_RAMDATA  ===================================================== */
#define MODEM_RAM133_RAMDATA_DATA_Pos     (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM133_RAMDATA_DATA_Msk     (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* ====================================================  RAM134_RAMDATA  ===================================================== */
#define MODEM_RAM134_RAMDATA_DATA_Pos     (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM134_RAMDATA_DATA_Msk     (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* ====================================================  RAM135_RAMDATA  ===================================================== */
#define MODEM_RAM135_RAMDATA_DATA_Pos     (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM135_RAMDATA_DATA_Msk     (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* ====================================================  RAM136_RAMDATA  ===================================================== */
#define MODEM_RAM136_RAMDATA_DATA_Pos     (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM136_RAMDATA_DATA_Msk     (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* ====================================================  RAM137_RAMDATA  ===================================================== */
#define MODEM_RAM137_RAMDATA_DATA_Pos     (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM137_RAMDATA_DATA_Msk     (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* ====================================================  RAM138_RAMDATA  ===================================================== */
#define MODEM_RAM138_RAMDATA_DATA_Pos     (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM138_RAMDATA_DATA_Msk     (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* ====================================================  RAM139_RAMDATA  ===================================================== */
#define MODEM_RAM139_RAMDATA_DATA_Pos     (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM139_RAMDATA_DATA_Msk     (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* ====================================================  RAM140_RAMDATA  ===================================================== */
#define MODEM_RAM140_RAMDATA_DATA_Pos     (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM140_RAMDATA_DATA_Msk     (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* ====================================================  RAM141_RAMDATA  ===================================================== */
#define MODEM_RAM141_RAMDATA_DATA_Pos     (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM141_RAMDATA_DATA_Msk     (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* ====================================================  RAM142_RAMDATA  ===================================================== */
#define MODEM_RAM142_RAMDATA_DATA_Pos     (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM142_RAMDATA_DATA_Msk     (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* ====================================================  RAM143_RAMDATA  ===================================================== */
#define MODEM_RAM143_RAMDATA_DATA_Pos     (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM143_RAMDATA_DATA_Msk     (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* ====================================================  RAM144_RAMDATA  ===================================================== */
#define MODEM_RAM144_RAMDATA_DATA_Pos     (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM144_RAMDATA_DATA_Msk     (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* ====================================================  RAM145_RAMDATA  ===================================================== */
#define MODEM_RAM145_RAMDATA_DATA_Pos     (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM145_RAMDATA_DATA_Msk     (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* ====================================================  RAM146_RAMDATA  ===================================================== */
#define MODEM_RAM146_RAMDATA_DATA_Pos     (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM146_RAMDATA_DATA_Msk     (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* ====================================================  RAM147_RAMDATA  ===================================================== */
#define MODEM_RAM147_RAMDATA_DATA_Pos     (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM147_RAMDATA_DATA_Msk     (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* ====================================================  RAM148_RAMDATA  ===================================================== */
#define MODEM_RAM148_RAMDATA_DATA_Pos     (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM148_RAMDATA_DATA_Msk     (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* ====================================================  RAM149_RAMDATA  ===================================================== */
