VDowbensky/efr32_baremetal/baremetal_test/device/efr32fg1v_modem_1.h
#define MODEM_RAM149_RAMDATA_DATA_Pos     (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM149_RAMDATA_DATA_Msk     (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* ====================================================  RAM150_RAMDATA  ===================================================== */
#define MODEM_RAM150_RAMDATA_DATA_Pos     (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM150_RAMDATA_DATA_Msk     (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* ====================================================  RAM151_RAMDATA  ===================================================== */
#define MODEM_RAM151_RAMDATA_DATA_Pos     (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM151_RAMDATA_DATA_Msk     (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* ====================================================  RAM152_RAMDATA  ===================================================== */
#define MODEM_RAM152_RAMDATA_DATA_Pos     (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM152_RAMDATA_DATA_Msk     (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* ====================================================  RAM153_RAMDATA  ===================================================== */
#define MODEM_RAM153_RAMDATA_DATA_Pos     (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM153_RAMDATA_DATA_Msk     (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* ====================================================  RAM154_RAMDATA  ===================================================== */
#define MODEM_RAM154_RAMDATA_DATA_Pos     (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM154_RAMDATA_DATA_Msk     (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* ====================================================  RAM155_RAMDATA  ===================================================== */
#define MODEM_RAM155_RAMDATA_DATA_Pos     (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM155_RAMDATA_DATA_Msk     (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* ====================================================  RAM156_RAMDATA  ===================================================== */
#define MODEM_RAM156_RAMDATA_DATA_Pos     (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM156_RAMDATA_DATA_Msk     (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* ====================================================  RAM157_RAMDATA  ===================================================== */
#define MODEM_RAM157_RAMDATA_DATA_Pos     (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM157_RAMDATA_DATA_Msk     (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* ====================================================  RAM158_RAMDATA  ===================================================== */
#define MODEM_RAM158_RAMDATA_DATA_Pos     (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM158_RAMDATA_DATA_Msk     (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* ====================================================  RAM159_RAMDATA  ===================================================== */
#define MODEM_RAM159_RAMDATA_DATA_Pos     (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM159_RAMDATA_DATA_Msk     (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* ====================================================  RAM160_RAMDATA  ===================================================== */
#define MODEM_RAM160_RAMDATA_DATA_Pos     (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM160_RAMDATA_DATA_Msk     (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* ====================================================  RAM161_RAMDATA  ===================================================== */
#define MODEM_RAM161_RAMDATA_DATA_Pos     (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM161_RAMDATA_DATA_Msk     (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* ====================================================  RAM162_RAMDATA  ===================================================== */
#define MODEM_RAM162_RAMDATA_DATA_Pos     (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM162_RAMDATA_DATA_Msk     (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* ====================================================  RAM163_RAMDATA  ===================================================== */
#define MODEM_RAM163_RAMDATA_DATA_Pos     (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM163_RAMDATA_DATA_Msk     (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* ====================================================  RAM164_RAMDATA  ===================================================== */
#define MODEM_RAM164_RAMDATA_DATA_Pos     (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM164_RAMDATA_DATA_Msk     (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* ====================================================  RAM165_RAMDATA  ===================================================== */
#define MODEM_RAM165_RAMDATA_DATA_Pos     (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM165_RAMDATA_DATA_Msk     (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* ====================================================  RAM166_RAMDATA  ===================================================== */
#define MODEM_RAM166_RAMDATA_DATA_Pos     (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM166_RAMDATA_DATA_Msk     (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* ====================================================  RAM167_RAMDATA  ===================================================== */
#define MODEM_RAM167_RAMDATA_DATA_Pos     (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM167_RAMDATA_DATA_Msk     (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* ====================================================  RAM168_RAMDATA  ===================================================== */
#define MODEM_RAM168_RAMDATA_DATA_Pos     (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM168_RAMDATA_DATA_Msk     (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* ====================================================  RAM169_RAMDATA  ===================================================== */
#define MODEM_RAM169_RAMDATA_DATA_Pos     (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM169_RAMDATA_DATA_Msk     (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* ====================================================  RAM170_RAMDATA  ===================================================== */
#define MODEM_RAM170_RAMDATA_DATA_Pos     (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM170_RAMDATA_DATA_Msk     (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* ====================================================  RAM171_RAMDATA  ===================================================== */
#define MODEM_RAM171_RAMDATA_DATA_Pos     (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM171_RAMDATA_DATA_Msk     (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* ====================================================  RAM172_RAMDATA  ===================================================== */
#define MODEM_RAM172_RAMDATA_DATA_Pos     (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM172_RAMDATA_DATA_Msk     (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* ====================================================  RAM173_RAMDATA  ===================================================== */
#define MODEM_RAM173_RAMDATA_DATA_Pos     (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM173_RAMDATA_DATA_Msk     (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* ====================================================  RAM174_RAMDATA  ===================================================== */
#define MODEM_RAM174_RAMDATA_DATA_Pos     (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM174_RAMDATA_DATA_Msk     (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* ====================================================  RAM175_RAMDATA  ===================================================== */
#define MODEM_RAM175_RAMDATA_DATA_Pos     (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM175_RAMDATA_DATA_Msk     (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* ====================================================  RAM176_RAMDATA  ===================================================== */
#define MODEM_RAM176_RAMDATA_DATA_Pos     (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM176_RAMDATA_DATA_Msk     (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* ====================================================  RAM177_RAMDATA  ===================================================== */
#define MODEM_RAM177_RAMDATA_DATA_Pos     (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM177_RAMDATA_DATA_Msk     (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* ====================================================  RAM178_RAMDATA  ===================================================== */
#define MODEM_RAM178_RAMDATA_DATA_Pos     (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM178_RAMDATA_DATA_Msk     (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* ====================================================  RAM179_RAMDATA  ===================================================== */
#define MODEM_RAM179_RAMDATA_DATA_Pos     (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM179_RAMDATA_DATA_Msk     (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* ====================================================  RAM180_RAMDATA  ===================================================== */
#define MODEM_RAM180_RAMDATA_DATA_Pos     (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM180_RAMDATA_DATA_Msk     (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* ====================================================  RAM181_RAMDATA  ===================================================== */
#define MODEM_RAM181_RAMDATA_DATA_Pos     (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM181_RAMDATA_DATA_Msk     (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* ====================================================  RAM182_RAMDATA  ===================================================== */
#define MODEM_RAM182_RAMDATA_DATA_Pos     (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM182_RAMDATA_DATA_Msk     (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* ====================================================  RAM183_RAMDATA  ===================================================== */
#define MODEM_RAM183_RAMDATA_DATA_Pos     (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM183_RAMDATA_DATA_Msk     (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* ====================================================  RAM184_RAMDATA  ===================================================== */
#define MODEM_RAM184_RAMDATA_DATA_Pos     (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM184_RAMDATA_DATA_Msk     (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* ====================================================  RAM185_RAMDATA  ===================================================== */
#define MODEM_RAM185_RAMDATA_DATA_Pos     (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM185_RAMDATA_DATA_Msk     (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* ====================================================  RAM186_RAMDATA  ===================================================== */
#define MODEM_RAM186_RAMDATA_DATA_Pos     (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM186_RAMDATA_DATA_Msk     (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* ====================================================  RAM187_RAMDATA  ===================================================== */
#define MODEM_RAM187_RAMDATA_DATA_Pos     (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM187_RAMDATA_DATA_Msk     (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* ====================================================  RAM188_RAMDATA  ===================================================== */
#define MODEM_RAM188_RAMDATA_DATA_Pos     (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM188_RAMDATA_DATA_Msk     (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* ====================================================  RAM189_RAMDATA  ===================================================== */
#define MODEM_RAM189_RAMDATA_DATA_Pos     (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM189_RAMDATA_DATA_Msk     (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* ====================================================  RAM190_RAMDATA  ===================================================== */
#define MODEM_RAM190_RAMDATA_DATA_Pos     (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM190_RAMDATA_DATA_Msk     (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* ====================================================  RAM191_RAMDATA  ===================================================== */
#define MODEM_RAM191_RAMDATA_DATA_Pos     (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM191_RAMDATA_DATA_Msk     (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* ====================================================  RAM192_RAMDATA  ===================================================== */
#define MODEM_RAM192_RAMDATA_DATA_Pos     (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM192_RAMDATA_DATA_Msk     (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* ====================================================  RAM193_RAMDATA  ===================================================== */
#define MODEM_RAM193_RAMDATA_DATA_Pos     (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM193_RAMDATA_DATA_Msk     (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* ====================================================  RAM194_RAMDATA  ===================================================== */
#define MODEM_RAM194_RAMDATA_DATA_Pos     (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM194_RAMDATA_DATA_Msk     (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* ====================================================  RAM195_RAMDATA  ===================================================== */
#define MODEM_RAM195_RAMDATA_DATA_Pos     (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM195_RAMDATA_DATA_Msk     (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* ====================================================  RAM196_RAMDATA  ===================================================== */
#define MODEM_RAM196_RAMDATA_DATA_Pos     (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM196_RAMDATA_DATA_Msk     (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* ====================================================  RAM197_RAMDATA  ===================================================== */
#define MODEM_RAM197_RAMDATA_DATA_Pos     (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM197_RAMDATA_DATA_Msk     (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* ====================================================  RAM198_RAMDATA  ===================================================== */
#define MODEM_RAM198_RAMDATA_DATA_Pos     (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM198_RAMDATA_DATA_Msk     (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* ====================================================  RAM199_RAMDATA  ===================================================== */
#define MODEM_RAM199_RAMDATA_DATA_Pos     (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM199_RAMDATA_DATA_Msk     (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* ====================================================  RAM200_RAMDATA  ===================================================== */
#define MODEM_RAM200_RAMDATA_DATA_Pos     (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM200_RAMDATA_DATA_Msk     (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* ====================================================  RAM201_RAMDATA  ===================================================== */
#define MODEM_RAM201_RAMDATA_DATA_Pos     (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM201_RAMDATA_DATA_Msk     (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* ====================================================  RAM202_RAMDATA  ===================================================== */
#define MODEM_RAM202_RAMDATA_DATA_Pos     (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM202_RAMDATA_DATA_Msk     (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* ====================================================  RAM203_RAMDATA  ===================================================== */
#define MODEM_RAM203_RAMDATA_DATA_Pos     (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM203_RAMDATA_DATA_Msk     (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* ====================================================  RAM204_RAMDATA  ===================================================== */
#define MODEM_RAM204_RAMDATA_DATA_Pos     (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM204_RAMDATA_DATA_Msk     (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* ====================================================  RAM205_RAMDATA  ===================================================== */
#define MODEM_RAM205_RAMDATA_DATA_Pos     (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM205_RAMDATA_DATA_Msk     (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* ====================================================  RAM206_RAMDATA  ===================================================== */
#define MODEM_RAM206_RAMDATA_DATA_Pos     (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM206_RAMDATA_DATA_Msk     (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* ====================================================  RAM207_RAMDATA  ===================================================== */
#define MODEM_RAM207_RAMDATA_DATA_Pos     (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM207_RAMDATA_DATA_Msk     (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* ====================================================  RAM208_RAMDATA  ===================================================== */
#define MODEM_RAM208_RAMDATA_DATA_Pos     (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM208_RAMDATA_DATA_Msk     (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* ====================================================  RAM209_RAMDATA  ===================================================== */
#define MODEM_RAM209_RAMDATA_DATA_Pos     (0UL)                     /*!< DATA (Bit 0)                                          */
#define MODEM_RAM209_RAMDATA_DATA_Msk     (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* ====================================================  RAM210_RAMDATA  ===================================================== */
#define MODEM_RAM210_RAMDATA_DATA_Pos     (0UL)                     /*!< DATA (Bit 0)                                          */
